[
  {
    "Alert": "(Preview) Suspicious population-level spike in API traffic to an API endpoint",
    "Description": "A suspicious spike in API traffic was detected at one of the API endpoints. The detection system used historical traffic patterns to establish a baseline for routine API traffic volume between all IPs and the endpoint  with the baseline being specific to API traffic for each status code (such as 200 Success). The detection system flagged an unusual deviation from this baseline leading to the detection of suspicious activity.",
    "MITRE tactics": "Impact",
    "Severity": "Medium",
    "Alert Family": "Alerts for Defender for APIs",
    "Alert Type ()": "(API_PopulationSpikeInAPITraffic)"
  },
  {
    "Alert": "(Preview) Suspicious spike in API traffic from a single IP address to an API endpoint",
    "Description": "A suspicious spike in API traffic was detected from a client IP to the API endpoint. The detection system used historical traffic patterns to establish a baseline for routine API traffic volume to the endpoint coming from a specific IP to the endpoint. The detection system flagged an unusual deviation from this baseline leading to the detection of suspicious activity.",
    "MITRE tactics": "Impact",
    "Severity": "Medium",
    "Alert Family": "Alerts for Defender for APIs",
    "Alert Type ()": "(API_SpikeInAPITraffic)"
  },
  {
    "Alert": "(Preview) Unusually large response payload transmitted between a single IP address and an API endpoint",
    "Description": "A suspicious spike in API response payload size was observed for traffic between a single IP and one of the API endpoints. Based on historical traffic patterns from the last 30 days  Defender for APIs learns a baseline that represents the typical API response payload size between a specific IP and API endpoint. The learned baseline is specific to API traffic for each status code (e.g.  200 Success). The alert was triggered because an API response payload size deviated significantly from the historical baseline.",
    "MITRE tactics": "Initial access",
    "Severity": "Medium",
    "Alert Family": "Alerts for Defender for APIs",
    "Alert Type ()": "(API_SpikeInPayload)"
  },
  {
    "Alert": "(Preview) Unusually large request body transmitted between a single IP address and an API endpoint",
    "Description": "A suspicious spike in API request body size was observed for traffic between a single IP and one of the API endpoints. Based on historical traffic patterns from the last 30 days  Defender for APIs learns a baseline that represents the typical API request body size between a specific IP and API endpoint. The learned baseline is specific to API traffic for each status code (e.g.  200 Success). The alert was triggered because an API request size deviated significantly from the historical baseline.",
    "MITRE tactics": "Initial access",
    "Severity": "Medium",
    "Alert Family": "Alerts for Defender for APIs",
    "Alert Type ()": "(API_SpikeInPayload)"
  },
  {
    "Alert": "(Preview) Suspicious spike in latency for traffic between a single IP address and an API endpoint",
    "Description": "A suspicious spike in latency was observed for traffic between a single IP and one of the API endpoints. Based on historical traffic patterns from the last 30 days  Defender for APIs learns a baseline that represents the routine API traffic latency between a specific IP and API endpoint. The learned baseline is specific to API traffic for each status code (e.g.  200 Success). The alert was triggered because an API call latency deviated significantly from the historical baseline.",
    "MITRE tactics": "Initial access",
    "Severity": "Medium",
    "Alert Family": "Alerts for Defender for APIs",
    "Alert Type ()": "(API_SpikeInLatency)"
  },
  {
    "Alert": "(Preview) API requests spray from a single IP address to an unusually large number of distinct API endpoints",
    "Description": "A single IP was observed making API calls to an unusually large number of distinct endpoints. Based on historical traffic patterns from the last 30 days  Defenders for APIs learns a baseline that represents the typical number of distinct endpoints called by a single IP across 20-minute windows. The alert was triggered because a single IP's behavior deviated significantly from the historical baseline.",
    "MITRE tactics": "Discovery",
    "Severity": "Medium",
    "Alert Family": "Alerts for Defender for APIs",
    "Alert Type ()": "(API_SprayInRequests)"
  },
  {
    "Alert": "(Preview) Parameter enumeration on an API endpoint",
    "Description": "A single IP was observed enumerating parameters when accessing one of the API endpoints. Based on historical traffic patterns from the last 30 days  Defender for APIs learns a baseline that represents the typical number of distinct parameter values used by a single IP when accessing this endpoint across 20-minute windows. The alert was triggered because a single client IP recently accessed an endpoint using an unusually large number of distinct parameter values.",
    "MITRE tactics": "Initial access",
    "Severity": "Medium",
    "Alert Family": "Alerts for Defender for APIs",
    "Alert Type ()": "(API_ParameterEnumeration)"
  },
  {
    "Alert": "(Preview) Distributed parameter enumeration on an API endpoint",
    "Description": "The aggregate user population (all IPs) was observed enumerating parameters when accessing one of the API endpoints. Based on historical traffic patterns from the last 30 days  Defender for APIs learns a baseline that represents the typical number of distinct parameter values used by the user population (all IPs) when accessing an endpoint across 20-minute windows. The alert was triggered because the user population recently accessed an endpoint using an unusually large number of distinct parameter values.",
    "MITRE tactics": "Initial access",
    "Severity": "Medium",
    "Alert Family": "Alerts for Defender for APIs",
    "Alert Type ()": "(API_DistributedParameterEnumeration)"
  },
  {
    "Alert": "(Preview) Parameter value(s) with anomalous data types in an API call",
    "Description": "A single IP was observed accessing one of your API endpoints and using parameter values of a low probability data type (e.g.  string  integer  etc.). Based on historical traffic patterns from the last 30 days  Defender for APIs learns the expected data types for each API parameter. The alert was triggered because an IP recently accessed an endpoint using a previously low probability data type as a parameter input.",
    "MITRE tactics": "Impact",
    "Severity": "Medium",
    "Alert Family": "Alerts for Defender for APIs",
    "Alert Type ()": "(API_UnseenParamType)"
  },
  {
    "Alert": "(Preview) Previously unseen parameter used in an API call",
    "Description": "A single IP was observed accessing one of the API endpoints using a previously unseen or out-of-bounds parameter in the request. Based on historical traffic patterns from the last 30 days  Defender for APIs learns a set of expected parameters associated with calls to an endpoint. The alert was triggered because an IP recently accessed an endpoint using a previously unseen parameter.",
    "MITRE tactics": "Impact",
    "Severity": "Medium",
    "Alert Family": "Alerts for Defender for APIs",
    "Alert Type ()": "(API_UnseenParam)"
  },
  {
    "Alert": "(Preview) Access from a Tor exit node to an API endpoint",
    "Description": "An IP address from the Tor network accessed one of your API endpoints. Tor is a network that allows people to access the Internet while keeping their real IP hidden. Though there are legitimate uses  it is frequently used by attackers to hide their identity when they target people's systems online.",
    "MITRE tactics": "Pre-attack",
    "Severity": "Medium",
    "Alert Family": "Alerts for Defender for APIs",
    "Alert Type ()": "(API_AccessFromTorExitNode)"
  },
  {
    "Alert": "(Preview) API Endpoint access from suspicious IP",
    "Description": "An IP address accessing one of your API endpoints was identified by Microsoft Threat Intelligence as having a high probability of being a threat. While observing malicious Internet traffic  this IP came up as involved in attacking other online targets.",
    "MITRE tactics": "Pre-attack",
    "Severity": "High",
    "Alert Family": "Alerts for Defender for APIs",
    "Alert Type ()": "(API_AccessFromSuspiciousIP)"
  },
  {
    "Alert": "(Preview) Suspicious User Agent detected",
    "Description": "The user agent of a request accessing one of your API endpoints contained anomalous values indicative of an attempt at remote code execution. This does not mean that any of your API endpoints have been breached  but it does suggest that an attempted attack is underway.",
    "MITRE tactics": "Execution",
    "Severity": "Medium",
    "Alert Family": "Alerts for Defender for APIs",
    "Alert Type ()": "(API_AccessFromSuspiciousUserAgent)"
  },
  {
    "Alert": "DDoS Attack detected for Public IP",
    "Description": "DDoS Attack detected for Public IP (IP address) and being mitigated.",
    "MITRE tactics": "Probing",
    "Severity": "High",
    "Alert Family": "Alerts for Azure DDoS Protection",
    "Alert Type ()": "(NETWORK_DDOS_DETECTED)"
  },
  {
    "Alert": "DDoS Attack mitigated for Public IP",
    "Description": "DDoS Attack mitigated for Public IP (IP address).",
    "MITRE tactics": "Probing",
    "Severity": "Low",
    "Alert Family": "Alerts for Azure DDoS Protection",
    "Alert Type ()": "(NETWORK_DDOS_MITIGATED)"
  },
  {
    "Alert": "Access from a suspicious IP address to a key vault",
    "Description": "A key vault has been successfully accessed by an IP that has been identified by Microsoft Threat Intelligence as a suspicious IP address. This may indicate that your infrastructure has been compromised. We recommend further investigation. Learn more aboutÿMicrosoft's threat intelligence capabilities.",
    "MITRE tactics": "Credential Access",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure Key Vault",
    "Alert Type ()": "(KV_SuspiciousIPAccess)"
  },
  {
    "Alert": "Access from a TOR exit node to a key vault",
    "Description": "A key vault has been accessed from a known TOR exit node. This could be an indication that a threat actor has accessed the key vault and is using the TOR network to hide their source location. We recommend further investigations.",
    "MITRE tactics": "Credential Access",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure Key Vault",
    "Alert Type ()": "(KV_TORAccess)"
  },
  {
    "Alert": "High volume of operations in a key vault",
    "Description": "An anomalous number of key vault operations were performed by a user  service principal  and/or a specific key vault. This anomalous activity pattern may be legitimate  but it could be an indication that a threat actor has gained access to the key vault and the secrets contained within it. We recommend further investigations.",
    "MITRE tactics": "Credential Access",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure Key Vault",
    "Alert Type ()": "(KV_OperationVolumeAnomaly)"
  },
  {
    "Alert": "Suspicious policy change and secret query in a key vault",
    "Description": "A user or service principal has performed an anomalous Vault Put policy change operation followed by one or more Secret Get operations. This pattern is not normally performed by the specified user or service principal. This may be legitimate activity  but it could be an indication that a threat actor has updated the key vault policy to access previously inaccessible secrets. We recommend further investigations.",
    "MITRE tactics": "Credential Access",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure Key Vault",
    "Alert Type ()": "(KV_PutGetAnomaly)"
  },
  {
    "Alert": "Suspicious secret listing and query in a key vault",
    "Description": "A user or service principal has performed an anomalous Secret List operation followed by one or more Secret Get operations. This pattern is not normally performed by the specified user or service principal and is typically associated with secret dumping. This may be legitimate activity  but it could be an indication that a threat actor has gained access to the key vault and is trying to discover secrets that can be used to move laterally through your network and/or gain access to sensitive resources. We recommend further investigations.",
    "MITRE tactics": "Credential Access",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure Key Vault",
    "Alert Type ()": "(KV_ListGetAnomaly)"
  },
  {
    "Alert": "Unusual access denied - User accessing high volume of key vaults denied",
    "Description": "A user or service principal has attempted access to anomalously high volume of key vaults in the last 24 hours. This anomalous access pattern may be legitimate activity. Though this attempt was unsuccessful  it could be an indication of a possible attempt to gain access of key vault and the secrets contained within it. We recommend further investigations.",
    "MITRE tactics": "Discovery",
    "Severity": "Low",
    "Alert Family": "Alerts for Azure Key Vault",
    "Alert Type ()": "(KV_AccountVolumeAccessDeniedAnomaly)"
  },
  {
    "Alert": "Unusual access denied - Unusual user accessing key vault denied",
    "Description": "A key vault access was attempted by a user that does not normally access it  this anomalous access pattern may be legitimate activity. Though this attempt was unsuccessful  it could be an indication of a possible attempt to gain access of key vault and the secrets contained within it.",
    "MITRE tactics": "Initial Access  Discovery",
    "Severity": "Low",
    "Alert Family": "Alerts for Azure Key Vault",
    "Alert Type ()": "(KV_UserAccessDeniedAnomaly)"
  },
  {
    "Alert": "Unusual application accessed a key vault",
    "Description": "A key vault has been accessed by a service principal that doesn't normally access it. This anomalous access pattern may be legitimate activity  but it could be an indication that a threat actor has gained access to the key vault in an attempt to access the secrets contained within it. We recommend further investigations.",
    "MITRE tactics": "Credential Access",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure Key Vault",
    "Alert Type ()": "(KV_AppAnomaly)"
  },
  {
    "Alert": "Unusual operation pattern in a key vault",
    "Description": "An anomalous pattern of key vault operations was performed by a user  service principal  and/or a specific key vault. This anomalous activity pattern may be legitimate  but it could be an indication that a threat actor has gained access to the key vault and the secrets contained within it. We recommend further investigations.",
    "MITRE tactics": "Credential Access",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure Key Vault",
    "Alert Type ()": "(KV_OperationPatternAnomaly)"
  },
  {
    "Alert": "Unusual user accessed a key vault",
    "Description": "A key vault has been accessed by a user that does not normally access it. This anomalous access pattern may be legitimate activity  but it could be an indication that a threat actor has gained access to the key vault in an attempt to access the secrets contained within it. We recommend further investigations.",
    "MITRE tactics": "Credential Access",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure Key Vault",
    "Alert Type ()": "(KV_UserAnomaly)"
  },
  {
    "Alert": "Unusual user-application pair accessed a key vault",
    "Description": "A key vault has been accessed by a user-service principal pair that doesn't normally access it. This anomalous access pattern may be legitimate activity  but it could be an indication that a threat actor has gained access to the key vault in an attempt to access the secrets contained within it. We recommend further investigations.",
    "MITRE tactics": "Credential Access",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure Key Vault",
    "Alert Type ()": "(KV_UserAppAnomaly)"
  },
  {
    "Alert": "User accessed high volume of key vaults",
    "Description": "A user or service principal has accessed an anomalously high volume of key vaults. This anomalous access pattern may be legitimate activity  but it could be an indication that a threat actor has gained access to multiple key vaults in an attempt to access the secrets contained within them. We recommend further investigations.",
    "MITRE tactics": "Credential Access",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure Key Vault",
    "Alert Type ()": "(KV_AccountVolumeAnomaly)"
  },
  {
    "Alert": "Denied access from a suspicious IP to a key vault",
    "Description": "An unsuccessful key vault access has been attempted by an IP that has been identified by Microsoft Threat Intelligence as a suspicious IP address. Though this attempt was unsuccessful  it indicates that your infrastructure might have been compromised. We recommend further investigations.",
    "MITRE tactics": "Credential Access",
    "Severity": "Low",
    "Alert Family": "Alerts for Azure Key Vault",
    "Alert Type ()": "(KV_SuspiciousIPAccessDenied)"
  },
  {
    "Alert": "Unusual access to the key vault from a suspicious IP (Non-Microsoft or External)",
    "Description": "A user or service principal has attempted anomalous access to key vaults from a non-Microsoft IP in the last 24 hours. This anomalous access pattern may be legitimate activity. It could be an indication of a possible attempt to gain access of the key vault and the secrets contained within it. We recommend further investigations.",
    "MITRE tactics": "Credential Access",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure Key Vault",
    "Alert Type ()": "(KV_UnusualAccessSuspiciousIP)"
  },
  {
    "Alert": "Network communication with a malicious machine detected",
    "Description": "Network traffic analysis indicates that your machine (IP %{Victim IP}) has communicated with what is possibly a Command and Control center. When the compromised resource is a load balancer or an application gateway  the suspected activity might indicate that one or more of the resources in the backend pool (of the load balancer or application gateway) has communicated with what is possibly a Command and Control center.",
    "MITRE tactics": "Command and Control",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure network layer",
    "Alert Type ()": "(Network_CommunicationWithC2)"
  },
  {
    "Alert": "Possible compromised machine detected",
    "Description": "Threat intelligence indicates that your machine (at IP %{Machine IP}) may have been compromised by a malware of type Conficker. Conficker was a computer worm that targets the Microsoft Windows operating system and was first detected in November 2008. Conficker infected millions of computers including government  business and home computers in over 200 countries/regions  making it the largest known computer worm infection since the 2003 Welchia worm.",
    "MITRE tactics": "Command and Control",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure network layer",
    "Alert Type ()": "(Network_ResourceIpIndicatedAsMalicious)"
  },
  {
    "Alert": "Possible incoming %{Service Name} brute force attempts detected",
    "Description": "Network traffic analysis detected incoming %{Service Name} communication to %{Victim IP}  associated with your resource %{Compromised Host} from %{Attacker IP}. When the compromised resource is a load balancer or an application gateway  the suspected incoming traffic has been forwarded to one or more of the resources in the backend pool (of the load balancer or application gateway). Specifically  sampled network data shows suspicious activity between %{Start Time} and %{End Time} on port %{Victim Port}. This activity is consistent with brute force attempts against %{Service Name} servers.",
    "MITRE tactics": "PreAttack",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure network layer",
    "Alert Type ()": "(Generic_Incoming_BF_OneToOne)"
  },
  {
    "Alert": "Possible incoming SQL brute force attempts detected",
    "Description": "Network traffic analysis detected incoming SQL communication to %{Victim IP}  associated with your resource %{Compromised Host}  from %{Attacker IP}. When the compromised resource is a load balancer or an application gateway  the suspected incoming traffic has been forwarded to one or more of the resources in the backend pool (of the load balancer or application gateway). Specifically  sampled network data shows suspicious activity between %{Start Time} and %{End Time} on port %{Port Number} (%{SQL Service Type}). This activity is consistent with brute force attempts against SQL servers.",
    "MITRE tactics": "PreAttack",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure network layer",
    "Alert Type ()": "(SQL_Incoming_BF_OneToOne)"
  },
  {
    "Alert": "Possible outgoing denial-of-service attack detected",
    "Description": "Network traffic analysis detected anomalous outgoing activity originating from %{Compromised Host}  a resource in your deployment. This activity may indicate that your resource was compromised and is now engaged in denial-of-service attacks against external endpoints. When the compromised resource is a load balancer or an application gateway  the suspected activity might indicate that one or more of the resources in the backend pool (of the load balancer or application gateway) was compromised. Based on the volume of connections  we believe that the following IPs are possibly the targets of the DOS attack: %{Possible Victims}. Note that it is possible that the communication to some of these IPs is legitimate.",
    "MITRE tactics": "Impact",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure network layer",
    "Alert Type ()": "(DDOS)"
  },
  {
    "Alert": "Suspicious incoming RDP network activity from multiple sources",
    "Description": "Network traffic analysis detected anomalous incoming Remote Desktop Protocol (RDP) communication to %{Victim IP}  associated with your resource %{Compromised Host}  from multiple sources. When the compromised resource is a load balancer or an application gateway  the suspected incoming traffic has been forwarded to one or more of the resources in the backend pool (of the load balancer or application gateway). Specifically  sampled network data shows %{Number of Attacking IPs} unique IPs connecting to your resource  which is considered abnormal for this environment. This activity may indicate an attempt to brute force your RDP end point from multiple hosts (Botnet)",
    "MITRE tactics": "PreAttack",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure network layer",
    "Alert Type ()": "(RDP_Incoming_BF_ManyToOne)"
  },
  {
    "Alert": "Suspicious incoming RDP network activity",
    "Description": "Network traffic analysis detected anomalous incoming Remote Desktop Protocol (RDP) communication to %{Victim IP}  associated with your resource %{Compromised Host}  from %{Attacker IP}. When the compromised resource is a load balancer or an application gateway  the suspected incoming traffic has been forwarded to one or more of the resources in the backend pool (of the load balancer or application gateway). Specifically  sampled network data shows %{Number of Connections} incoming connections to your resource  which is considered abnormal for this environment. This activity may indicate an attempt to brute force your RDP end point",
    "MITRE tactics": "PreAttack",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure network layer",
    "Alert Type ()": "(RDP_Incoming_BF_OneToOne)"
  },
  {
    "Alert": "Suspicious incoming SSH network activity from multiple sources",
    "Description": "Network traffic analysis detected anomalous incoming SSH communication to %{Victim IP}  associated with your resource %{Compromised Host}  from multiple sources. When the compromised resource is a load balancer or an application gateway  the suspected incoming traffic has been forwarded to one or more of the resources in the backend pool (of the load balancer or application gateway). Specifically  sampled network data shows %{Number of Attacking IPs} unique IPs connecting to your resource  which is considered abnormal for this environment. This activity may indicate an attempt to brute force your SSH end point from multiple hosts (Botnet)",
    "MITRE tactics": "PreAttack",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure network layer",
    "Alert Type ()": "(SSH_Incoming_BF_ManyToOne)"
  },
  {
    "Alert": "Suspicious incoming SSH network activity",
    "Description": "Network traffic analysis detected anomalous incoming SSH communication to %{Victim IP}  associated with your resource %{Compromised Host}  from %{Attacker IP}. When the compromised resource is a load balancer or an application gateway  the suspected incoming traffic has been forwarded to one or more of the resources in the backend pool (of the load balancer or application gateway). Specifically  sampled network data shows %{Number of Connections} incoming connections to your resource  which is considered abnormal for this environment. This activity may indicate an attempt to brute force your SSH end point",
    "MITRE tactics": "PreAttack",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure network layer",
    "Alert Type ()": "(SSH_Incoming_BF_OneToOne)"
  },
  {
    "Alert": "Suspicious outgoing %{Attacked Protocol} traffic detected",
    "Description": "Network traffic analysis detected suspicious outgoing traffic from %{Compromised Host} to destination port %{Most Common Port}. When the compromised resource is a load balancer or an application gateway  the suspected outgoing traffic has been originated from to one or more of the resources in the backend pool (of the load balancer or application gateway). This behavior may indicate that your resource is taking part in %{Attacked Protocol} brute force attempts or port sweeping attacks.",
    "MITRE tactics": "Discovery",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure network layer",
    "Alert Type ()": "(PortScanning)"
  },
  {
    "Alert": "Suspicious outgoing RDP network activity to multiple destinations",
    "Description": "Network traffic analysis detected anomalous outgoing Remote Desktop Protocol (RDP) communication to multiple destinations originating from %{Compromised Host} (%{Attacker IP})  a resource in your deployment. When the compromised resource is a load balancer or an application gateway  the suspected outgoing traffic has been originated from to one or more of the resources in the backend pool (of the load balancer or application gateway). Specifically  sampled network data shows your machine connecting to %{Number of Attacked IPs} unique IPs  which is considered abnormal for this environment. This activity may indicate that your resource was compromised and is now used to brute force external RDP end points. Note that this type of activity could possibly cause your IP to be flagged as malicious by external entities.",
    "MITRE tactics": "Discovery",
    "Severity": "High",
    "Alert Family": "Alerts for Azure network layer",
    "Alert Type ()": "(RDP_Outgoing_BF_OneToMany)"
  },
  {
    "Alert": "Suspicious outgoing RDP network activity",
    "Description": "Network traffic analysis detected anomalous outgoing Remote Desktop Protocol (RDP) communication to %{Victim IP} originating from %{Compromised Host} (%{Attacker IP})  a resource in your deployment. When the compromised resource is a load balancer or an application gateway  the suspected outgoing traffic has been originated from to one or more of the resources in the backend pool (of the load balancer or application gateway). Specifically  sampled network data shows %{Number of Connections} outgoing connections from your resource  which is considered abnormal for this environment. This activity may indicate that your machine was compromised and is now used to brute force external RDP end points. Note that this type of activity could possibly cause your IP to be flagged as malicious by external entities.",
    "MITRE tactics": "Lateral Movement",
    "Severity": "High",
    "Alert Family": "Alerts for Azure network layer",
    "Alert Type ()": "(RDP_Outgoing_BF_OneToOne)"
  },
  {
    "Alert": "Suspicious outgoing SSH network activity to multiple destinations",
    "Description": "Network traffic analysis detected anomalous outgoing SSH communication to multiple destinations originating from %{Compromised Host} (%{Attacker IP})  a resource in your deployment. When the compromised resource is a load balancer or an application gateway  the suspected outgoing traffic has been originated from to one or more of the resources in the backend pool (of the load balancer or application gateway). Specifically  sampled network data shows your resource connecting to %{Number of Attacked IPs} unique IPs  which is considered abnormal for this environment. This activity may indicate that your resource was compromised and is now used to brute force external SSH end points. Note that this type of activity could possibly cause your IP to be flagged as malicious by external entities.",
    "MITRE tactics": "Discovery",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure network layer",
    "Alert Type ()": "(SSH_Outgoing_BF_OneToMany)"
  },
  {
    "Alert": "Suspicious outgoing SSH network activity",
    "Description": "Network traffic analysis detected anomalous outgoing SSH communication to %{Victim IP} originating from %{Compromised Host} (%{Attacker IP})  a resource in your deployment. When the compromised resource is a load balancer or an application gateway  the suspected outgoing traffic has been originated from to one or more of the resources in the backend pool (of the load balancer or application gateway). Specifically  sampled network data shows %{Number of Connections} outgoing connections from your resource  which is considered abnormal for this environment. This activity may indicate that your resource was compromised and is now used to brute force external SSH end points. Note that this type of activity could possibly cause your IP to be flagged as malicious by external entities.",
    "MITRE tactics": "Lateral Movement",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure network layer",
    "Alert Type ()": "(SSH_Outgoing_BF_OneToOne)"
  },
  {
    "Alert": "Traffic detected from IP addresses recommended for blocking",
    "Description": "Microsoft Defender for Cloud detected inbound traffic from IP addresses that are recommended to be blocked. This typically occurs when this IP address doesn't communicate regularly with this resource. Alternatively  the IP address has been flagged as malicious by Defender for Cloud's threat intelligence sources.",
    "MITRE tactics": "Probing",
    "Severity": "Low",
    "Alert Family": "Alerts for Azure network layer",
    "Alert Type ()": ""
  },
  {
    "Alert": "Access from a Tor exit node",
    "Description": "This Azure Cosmos DB account was successfully accessed from an IP address known to be an active exit node of Tor  an anonymizing proxy. Authenticated access from a Tor exit node is a likely indication that a threat actor is trying to hide their identity.",
    "MITRE tactics": "Initial Access",
    "Severity": "High/Medium",
    "Alert Family": "Alerts for Azure Cosmos DB",
    "Alert Type ()": "(CosmosDB_TorAnomaly)"
  },
  {
    "Alert": "Access from a suspicious IP",
    "Description": "This Azure Cosmos DB account was successfully accessed from an IP address that was identified as a threat by Microsoft Threat Intelligence.",
    "MITRE tactics": "Initial Access",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure Cosmos DB",
    "Alert Type ()": "(CosmosDB_SuspiciousIp)"
  },
  {
    "Alert": "Access from an unusual location",
    "Description": "This Azure Cosmos DB account was accessed from a location considered unfamiliar  based on the usual access pattern.",
    "MITRE tactics": "Initial Access",
    "Severity": "Low",
    "Alert Family": "Alerts for Azure Cosmos DB",
    "Alert Type ()": "(CosmosDB_GeoAnomaly)"
  },
  {
    "Alert": "Unusual volume of data extracted",
    "Description": "An unusually large volume of data has been extracted from this Azure Cosmos DB account. This might indicate that a threat actor exfiltrated data.",
    "MITRE tactics": "Exfiltration",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure Cosmos DB",
    "Alert Type ()": "(CosmosDB_DataExfiltrationAnomaly)"
  },
  {
    "Alert": "Extraction of Azure Cosmos DB accounts keys via a potentially malicious script",
    "Description": "A PowerShell script was run in your subscription and performed a suspicious pattern of key-listing operations to get the keys of Azure Cosmos DB accounts in your subscription. Threat actors use automated scripts  like Microburst  to list keys and find Azure Cosmos DB accounts they can access.",
    "MITRE tactics": "Collection",
    "Severity": "High",
    "Alert Family": "Alerts for Azure Cosmos DB",
    "Alert Type ()": "(CosmosDB_SuspiciousListKeys.MaliciousScript)"
  },
  {
    "Alert": "Suspicious extraction of Azure Cosmos DB account keys",
    "Description": "A suspicious source extracted Azure Cosmos DB account access keys from your subscription. If this source is not a legitimate source  this may be a high impact issue. The access key that was extracted provides full control over the associated databases and the data stored within. See the details of each specific alert to understand why the source was flagged as suspicious.",
    "MITRE tactics": "Credential Access",
    "Severity": "high",
    "Alert Family": "Alerts for Azure Cosmos DB",
    "Alert Type ()": "(AzureCosmosDB_SuspiciousListKeys.SuspiciousPrincipal)"
  },
  {
    "Alert": "SQL injection: potential data exfiltration",
    "Description": "A suspicious SQL statement was used to query a container in this Azure Cosmos DB account.",
    "MITRE tactics": "Exfiltration",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure Cosmos DB",
    "Alert Type ()": "(CosmosDB_SqlInjection.DataExfiltration)"
  },
  {
    "Alert": "SQL injection: fuzzing attempt",
    "Description": "A suspicious SQL statement was used to query a container in this Azure Cosmos DB account.",
    "MITRE tactics": "Pre-attack",
    "Severity": "Low",
    "Alert Family": "Alerts for Azure Cosmos DB",
    "Alert Type ()": "(CosmosDB_SqlInjection.FailedFuzzingAttempt)"
  },
  {
    "Alert": "Access from a suspicious application",
    "Description": "Indicates that a suspicious application has successfully accessed a container of a storage account with authentication.",
    "MITRE tactics": "Initial Access",
    "Severity": "High/Medium",
    "Alert Family": "Alerts for Azure Storage",
    "Alert Type ()": "(Storage.Blob_SuspiciousApp)"
  },
  {
    "Alert": "Access from a suspicious IP address",
    "Description": "Indicates that this storage account has been successfully accessed from an IP address that is considered suspicious. This alert is powered by Microsoft Threat Intelligence.",
    "MITRE tactics": "Pre Attack",
    "Severity": "High/Medium/Low",
    "Alert Family": "Alerts for Azure Storage",
    "Alert Type ()": "(Storage.Blob_SuspiciousIp Storage.Files_SuspiciousIp)"
  },
  {
    "Alert": "Phishing content hosted on a storage account",
    "Description": "A URL used in a phishing attack points to your Azure Storage account. This URL was part of a phishing attack affecting users of Microsoft 365.",
    "MITRE tactics": "Collection",
    "Severity": "High",
    "Alert Family": "Alerts for Azure Storage",
    "Alert Type ()": "(Storage.Blob_PhishingContent Storage.Files_PhishingContent)"
  },
  {
    "Alert": "Storage account identified as source for distribution of malware",
    "Description": "Antimalware alerts indicate that an infected file(s) is stored in an Azure file share that is mounted to multiple VMs. If attackers gain access to a VM with a mounted Azure file share  they can use it to spread malware to other VMs that mount the same share.",
    "MITRE tactics": "Execution",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure Storage",
    "Alert Type ()": "(Storage.Files_WidespreadeAm)"
  },
  {
    "Alert": "The access level of a potentially sensitive storage blob container was changed to allow unauthenticated public access",
    "Description": "The alert indicates that someone has changed the access level of a blob container in the storage account  which may contain sensitive data  to the ?Container? level  to allow unauthenticated (anonymous) public access. The change was made through the Azure portal.",
    "MITRE tactics": "Collection",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure Storage",
    "Alert Type ()": "(Storage.Blob_OpenACL)"
  },
  {
    "Alert": "Authenticated access from a Tor exit node",
    "Description": "One or more storage container(s) / file share(s) in your storage account were successfully accessed from an IP address known to be an active exit node of Tor (an anonymizing proxy). Threat actors use Tor to make it difficult to trace the activity back to them. Authenticated access from a Tor exit node is a likely indication that a threat actor is trying to hide their identity.",
    "MITRE tactics": "Initial Access / Pre Attack",
    "Severity": "High/Medium",
    "Alert Family": "Alerts for Azure Storage",
    "Alert Type ()": "(Storage.Blob_TorAnomaly Storage.Files_TorAnomaly)"
  },
  {
    "Alert": "Access from an unusual location to a storage account",
    "Description": "Indicates that there was a change in the access pattern to an Azure Storage account. Someone has accessed this account from an IP address considered unfamiliar when compared with recent activity. Either an attacker has gained access to the account  or a legitimate user has connected from a new or unusual geographic location. An example of the latter is remote maintenance from a new application or developer.",
    "MITRE tactics": "Initial Access",
    "Severity": "High/Medium/Low",
    "Alert Family": "Alerts for Azure Storage",
    "Alert Type ()": "(Storage.Blob_GeoAnomaly"
  },
  {
    "Alert": "Unusual unauthenticated access to a storage container",
    "Description": "This storage account was accessed without authentication  which is a change in the common access pattern. Read access to this container is usually authenticated. This might indicate that a threat actor was able to exploit public read access to storage container(s) in this storage account(s).",
    "MITRE tactics": "Initial Access",
    "Severity": "High/Low",
    "Alert Family": "Alerts for Azure Storage",
    "Alert Type ()": "Storage.Files_GeoAnomaly)"
  },
  {
    "Alert": "Potential malware uploaded to a storage account",
    "Description": "Indicates that a blob containing potential malware has been uploaded to a blob container or a file share in a storage account. This alert is based on hash reputation analysis leveraging the power of Microsoft threat intelligence  which includes hashes for viruses  trojans  spyware and ransomware. Potential causes may include an intentional malware upload by an attacker  or an unintentional upload of a potentially malicious blob by a legitimate user.",
    "MITRE tactics": "Lateral Movement",
    "Severity": "High",
    "Alert Family": "Alerts for Azure Storage",
    "Alert Type ()": "(Storage.Blob_MalwareHashReputation Storage.Files_MalwareHashReputation)"
  },
  {
    "Alert": "Publicly accessible storage containers successfully discovered",
    "Description": "A successful discovery of publicly open storage container(s) in your storage account was performed in the last hour by a scanning script or tool.",
    "MITRE tactics": "Collection",
    "Severity": "High/Medium",
    "Alert Family": "Alerts for Azure Storage",
    "Alert Type ()": "(Storage.Blob_OpenContainersScanning.SuccessfulDiscovery)"
  },
  {
    "Alert": "Publicly accessible storage containers unsuccessfully scanned",
    "Description": "A series of failed attempts to scan for publicly open storage containers were performed in the last hour.",
    "MITRE tactics": "Collection",
    "Severity": "High/Low",
    "Alert Family": "Alerts for Azure Storage",
    "Alert Type ()": "(Storage.Blob_OpenContainersScanning.FailedAttempt)"
  },
  {
    "Alert": "Unusual access inspection in a storage account",
    "Description": "Indicates that the access permissions of a storage account have been inspected in an unusual way  compared to recent activity on this account. A potential cause is that an attacker has performed reconnaissance for a future attack.",
    "MITRE tactics": "Discovery",
    "Severity": "High/Medium",
    "Alert Family": "Alerts for Azure Storage",
    "Alert Type ()": "(Storage.Blob_AccessInspectionAnomaly Storage.Files_AccessInspectionAnomaly)"
  },
  {
    "Alert": "Unusual amount of data extracted from a storage account",
    "Description": "Indicates that an unusually large amount of data has been extracted compared to recent activity on this storage container. A potential cause is that an attacker has extracted a large amount of data from a container that holds blob storage.",
    "MITRE tactics": "Exfiltration",
    "Severity": "High/Low",
    "Alert Family": "Alerts for Azure Storage",
    "Alert Type ()": "(Storage.Blob_DataExfiltration.AmountOfDataAnomaly Storage.Blob_DataExfiltration.NumberOfBlobsAnomaly Storage.Files_DataExfiltration.AmountOfDataAnomaly Storage.Files_DataExfiltration.NumberOfFilesAnomaly)"
  },
  {
    "Alert": "Unusual application accessed a storage account",
    "Description": "Indicates that an unusual application has accessed this storage account. A potential cause is that an attacker has accessed your storage account by using a new application.",
    "MITRE tactics": "Execution",
    "Severity": "High/Medium",
    "Alert Family": "Alerts for Azure Storage",
    "Alert Type ()": "(Storage.Blob_ApplicationAnomaly Storage.Files_ApplicationAnomaly)"
  },
  {
    "Alert": "Unusual data exploration in a storage account",
    "Description": "Indicates that blobs or containers in a storage account have been enumerated in an abnormal way  compared to recent activity on this account. A potential cause is that an attacker has performed reconnaissance for a future attack.",
    "MITRE tactics": "Execution",
    "Severity": "High/Medium",
    "Alert Family": "Alerts for Azure Storage",
    "Alert Type ()": "(Storage.Blob_DataExplorationAnomaly Storage.Files_DataExplorationAnomaly)"
  },
  {
    "Alert": "Unusual deletion in a storage account",
    "Description": "Indicates that one or more unexpected delete operations has occurred in a storage account  compared to recent activity on this account. A potential cause is that an attacker has deleted data from your storage account.",
    "MITRE tactics": "Exfiltration",
    "Severity": "High/Medium",
    "Alert Family": "Alerts for Azure Storage",
    "Alert Type ()": "(Storage.Blob_DeletionAnomaly Storage.Files_DeletionAnomaly)"
  },
  {
    "Alert": "Unusual unauthenticated public access to a sensitive blob container (Preview)",
    "Description": "The alert indicates that someone accessed a blob container with sensitive data in the storage account without authentication  using an external (public) IP address. This access is suspicious since the blob container is open to public access and is typically only accessed with authentication from internal networks (private IP addresses). This access could indicate that the blob container?s access level is misconfigured  and a malicious actor may have exploited the public access. The security alert includes the discovered sensitive information context (scanning time  classification label  information types  and file types). Learn more on sensitive data threat detection.",
    "MITRE tactics": "Initial Access",
    "Severity": "High",
    "Alert Family": "Alerts for Azure Storage",
    "Alert Type ()": "Storage.Blob_AnonymousAccessAnomaly.Sensitive"
  },
  {
    "Alert": "Unusual amount of data extracted from a sensitive blob container (Preview)",
    "Description": "The alert indicates that someone has extracted an unusually large number of blobs from a blob container with sensitive data in the storage account.",
    "MITRE tactics": "Exfiltration",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure Storage",
    "Alert Type ()": "Storage.Blob_DataExfiltration.AmountOfDataAnomaly.Sensitive"
  },
  {
    "Alert": "Unusual number of blobs extracted from a sensitive blob container (Preview)",
    "Description": "The alert indicates that someone has extracted an unusually large amount of data from a blob container with sensitive data in the storage account.",
    "MITRE tactics": "Exfiltration",
    "Severity": "",
    "Alert Family": "Alerts for Azure Storage",
    "Alert Type ()": "Storage.Blob_DataExfiltration.NumberOfBlobsAnomaly.Sensitive"
  },
  {
    "Alert": "Access from a known suspicious application to a sensitive blob container (Preview)",
    "Description": "The alert indicates that someone with a known suspicious application accessed a blob container with sensitive data in the storage account and performed authenticated operations.",
    "MITRE tactics": "Initial Access",
    "Severity": "High",
    "Alert Family": "Alerts for Azure Storage",
    "Alert Type ()": "Storage.Blob_SuspiciousApp.Sensitive"
  },
  {
    "Alert": "Access from a known suspicious IP address to a sensitive blob container (Preview)",
    "Description": "The alert indicates that someone accessed a blob container with sensitive data in the storage account from a known suspicious IP address associated with threat intel by Microsoft Threat Intelligence. Since the access was authenticated  it?s possible that the credentials allowing access to this storage account were compromised.",
    "MITRE tactics": "Pre-Attack",
    "Severity": "High",
    "Alert Family": "Alerts for Azure Storage",
    "Alert Type ()": "Storage.Blob_SuspiciousIp.Sensitive"
  },
  {
    "Alert": "Access from a Tor exit node to a sensitive blob container (Preview)",
    "Description": "The alert indicates that someone with an IP address known to be a Tor exit node accessed a blob container with sensitive data in the storage account with authenticated access. Authenticated access from a Tor exit node strongly indicates that the actor is attempting to remain anonymous for possible malicious intent. Since the access was authenticated  it?s possible that the credentials allowing access to this storage account were compromised.",
    "MITRE tactics": "Pre-Attack",
    "Severity": "High",
    "Alert Family": "Alerts for Azure Storage",
    "Alert Type ()": "Storage.Blob_TorAnomaly.Sensitive"
  },
  {
    "Alert": "Access from an unusual location to a sensitive blob container (Preview)",
    "Description": "The alert indicates that someone has accessed blob container with sensitive data in the storage account with authentication from an unusual location. Since the access was authenticated  it?s possible that the credentials allowing access to this storage account were compromised.",
    "MITRE tactics": "Initial Access",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure Storage",
    "Alert Type ()": "Storage.Blob_GeoAnomaly.Sensitive"
  },
  {
    "Alert": "The access level of a sensitive storage blob container was changed to allow unauthenticated public access (Preview)",
    "Description": "The alert indicates that someone has changed the access level of a blob container in the storage account  which contains sensitive data  to the ?Container? level  which allows unauthenticated (anonymous) public access. The change was made through the Azure portal.",
    "MITRE tactics": "Collection",
    "Severity": "High",
    "Alert Family": "Alerts for Azure Storage",
    "Alert Type ()": "Storage.Blob_OpenACL.Sensitive"
  },
  {
    "Alert": "Suspicious external access to an Azure storage account with overly permissive SAS token (Preview)",
    "Description": "The alert indicates that someone with an external (public) IP address accessed the storage account using an overly permissive SAS token with a long expiration date. This type of access is considered suspicious because the SAS token is typically only used in internal networks (from private IP addresses).",
    "MITRE tactics": "Exfiltration / Resource Development / Impact",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure Storage",
    "Alert Type ()": "Storage.Blob_AccountSas.InternalSasUsedExternally"
  },
  {
    "Alert": "Suspicious external operation to an Azure storage account with overly permissive SAS token (Preview)",
    "Description": "The alert indicates that someone with an external (public) IP address accessed the storage account using an overly permissive SAS token with a long expiration date. The access is considered suspicious because operations invoked outside your network (not from private IP addresses) with this SAS token are typically used for a specific set of Read/Write/Delete operations  but other operations occurred  which makes this access suspicious.",
    "MITRE tactics": "Exfiltration / Resource Development / Impact",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure Storage",
    "Alert Type ()": "Storage.Blob_AccountSas.UnusualOperationFromExternalIp"
  },
  {
    "Alert": "Unusual SAS token was used to access an Azure storage account from a public IP address (Preview)",
    "Description": "The alert indicates that someone with an external (public) IP address has accessed the storage account using an account SAS token. The access is highly unusual and considered suspicious  as access to the storage account using SAS tokens typically comes only from internal (private) IP addresses.",
    "MITRE tactics": "Exfiltration / Resource Development / Impact",
    "Severity": "Low",
    "Alert Family": "Alerts for Azure Storage",
    "Alert Type ()": "Storage.Blob_AccountSas.UnusualExternalAccess"
  },
  {
    "Alert": "Malicious file uploaded to storage account (Preview)",
    "Description": "The alert indicates that a malicious blob was uploaded to a storage account. This security alert is generated by the Malware Scanning feature in Defender for Storage.",
    "MITRE tactics": "LateralMovement",
    "Severity": "High",
    "Alert Family": "Alerts for Azure Storage",
    "Alert Type ()": "Storage.Blob_AM.MalwareFound"
  },
  {
    "Alert": "Anomalous network protocol usage",
    "Description": "Analysis of DNS transactions from %{CompromisedEntity} detected anomalous protocol usage. Such traffic  while possibly benign  may indicate abuse of this common protocol to bypass network traffic filtering. Typical related attacker activity includes copying remote administration tools to a compromised host and exfiltrating user data from it.",
    "MITRE tactics": "Exfiltration",
    "Severity": "-",
    "Alert Family": "Alerts for DNS",
    "Alert Type ()": "(AzureDNS_ProtocolAnomaly)"
  },
  {
    "Alert": "Anonymity network activity",
    "Description": "Analysis of DNS transactions from %{CompromisedEntity} detected anonymity network activity. Such activity  while possibly legitimate user behavior  is frequently employed by attackers to evade tracking and fingerprinting of network communications. Typical related attacker activity is likely to include the download and execution of malicious software or remote administration tools.",
    "MITRE tactics": "Exfiltration",
    "Severity": "Low",
    "Alert Family": "Alerts for DNS",
    "Alert Type ()": "(AzureDNS_DarkWeb)"
  },
  {
    "Alert": "Anonymity network activity using web proxy",
    "Description": "Analysis of DNS transactions from %{CompromisedEntity} detected anonymity network activity. Such activity  while possibly legitimate user behavior  is frequently employed by attackers to evade tracking and fingerprinting of network communications. Typical related attacker activity is likely to include the download and execution of malicious software or remote administration tools.",
    "MITRE tactics": "Exfiltration",
    "Severity": "Low",
    "Alert Family": "Alerts for DNS",
    "Alert Type ()": "(AzureDNS_DarkWebProxy)"
  },
  {
    "Alert": "Attempted communication with suspicious sinkholed domain",
    "Description": "Analysis of DNS transactions from %{CompromisedEntity} detected request for sinkholed domain. Such activity  while possibly legitimate user behavior  is frequently an indication of the download or execution of malicious software. Typical related attacker activity is likely to include the download and execution of further malicious software or remote administration tools.",
    "MITRE tactics": "Exfiltration",
    "Severity": "Medium",
    "Alert Family": "Alerts for DNS",
    "Alert Type ()": "(AzureDNS_SinkholedDomain)"
  },
  {
    "Alert": "Communication with possible phishing domain",
    "Description": "Analysis of DNS transactions from %{CompromisedEntity} detected a request for a possible phishing domain. Such activity  while possibly benign  is frequently performed by attackers to harvest credentials to remote services. Typical related attacker activity is likely to include the exploitation of any credentials on the legitimate service.",
    "MITRE tactics": "Exfiltration",
    "Severity": "Low",
    "Alert Family": "Alerts for DNS",
    "Alert Type ()": "(AzureDNS_PhishingDomain)"
  },
  {
    "Alert": "Communication with suspicious algorithmically generated domain",
    "Description": "Analysis of DNS transactions from %{CompromisedEntity} detected possible usage of a domain generation algorithm. Such activity  while possibly benign  is frequently performed by attackers to evade network monitoring and filtering. Typical related attacker activity is likely to include the download and execution of malicious software or remote administration tools.",
    "MITRE tactics": "Exfiltration",
    "Severity": "Low",
    "Alert Family": "Alerts for DNS",
    "Alert Type ()": "(AzureDNS_DomainGenerationAlgorithm)"
  },
  {
    "Alert": "Communication with suspicious domain identified by threat intelligence",
    "Description": "Communication with suspicious domain was detected by analyzing DNS transactions from your resource and comparing against known malicious domains identified by threat intelligence feeds. Communication to malicious domains is frequently performed by attackers and could imply that your resource is compromised.",
    "MITRE tactics": "Initial Access",
    "Severity": "Medium",
    "Alert Family": "Alerts for DNS",
    "Alert Type ()": "(AzureDNS_ThreatIntelSuspectDomain)"
  },
  {
    "Alert": "Communication with suspicious random domain name",
    "Description": "Analysis of DNS transactions from %{CompromisedEntity} detected usage of a suspicious randomly generated domain name. Such activity  while possibly benign  is frequently performed by attackers to evade network monitoring and filtering. Typical related attacker activity is likely to include the download and execution of malicious software or remote administration tools.",
    "MITRE tactics": "Exfiltration",
    "Severity": "Low",
    "Alert Family": "Alerts for DNS",
    "Alert Type ()": "(AzureDNS_RandomizedDomain)"
  },
  {
    "Alert": "Digital currency mining activity",
    "Description": "Analysis of DNS transactions from %{CompromisedEntity} detected digital currency mining activity. Such activity  while possibly legitimate user behavior  is frequently performed by attackers following compromise of resources. Typical related attacker activity is likely to include the download and execution of common mining tools.",
    "MITRE tactics": "Exfiltration",
    "Severity": "Low",
    "Alert Family": "Alerts for DNS",
    "Alert Type ()": "(AzureDNS_CurrencyMining)"
  },
  {
    "Alert": "Network intrusion detection signature activation",
    "Description": "Analysis of DNS transactions from %{CompromisedEntity} detected a known malicious network signature. Such activity  while possibly legitimate user behavior  is frequently an indication of the download or execution of malicious software. Typical related attacker activity is likely to include the download and execution of further malicious software or remote administration tools.",
    "MITRE tactics": "Exfiltration",
    "Severity": "Medium",
    "Alert Family": "Alerts for DNS",
    "Alert Type ()": "(AzureDNS_SuspiciousDomain)"
  },
  {
    "Alert": "Possible data download via DNS tunnel",
    "Description": "Analysis of DNS transactions from %{CompromisedEntity} detected a possible DNS tunnel. Such activity  while possibly legitimate user behavior  is frequently performed by attackers to evade network monitoring and filtering. Typical related attacker activity is likely to include the download and execution of malicious software or remote administration tools.",
    "MITRE tactics": "Exfiltration",
    "Severity": "Low",
    "Alert Family": "Alerts for DNS",
    "Alert Type ()": "(AzureDNS_DataInfiltration)"
  },
  {
    "Alert": "Possible data exfiltration via DNS tunnel",
    "Description": "Analysis of DNS transactions from %{CompromisedEntity} detected a possible DNS tunnel. Such activity  while possibly legitimate user behavior  is frequently performed by attackers to evade network monitoring and filtering. Typical related attacker activity is likely to include the download and execution of malicious software or remote administration tools.",
    "MITRE tactics": "Exfiltration",
    "Severity": "Low",
    "Alert Family": "Alerts for DNS",
    "Alert Type ()": "(AzureDNS_DataExfiltration)"
  },
  {
    "Alert": "Possible data transfer via DNS tunnel",
    "Description": "Analysis of DNS transactions from %{CompromisedEntity} detected a possible DNS tunnel. Such activity  while possibly legitimate user behavior  is frequently performed by attackers to evade network monitoring and filtering. Typical related attacker activity is likely to include the download and execution of malicious software or remote administration tools.",
    "MITRE tactics": "Exfiltration",
    "Severity": "Low",
    "Alert Family": "Alerts for DNS",
    "Alert Type ()": "(AzureDNS_DataObfuscation)"
  },
  {
    "Alert": "Azure Resource Manager operation from suspicious IP address",
    "Description": "Microsoft Defender for Resource Manager detected an operation from an IP address that has been marked as suspicious in threat intelligence feeds.",
    "MITRE tactics": "Execution",
    "Severity": "Medium",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_OperationFromSuspiciousIP)"
  },
  {
    "Alert": "Azure Resource Manager operation from suspicious proxy IP address",
    "Description": "Microsoft Defender for Resource Manager detected a resource management operation from an IP address that is associated with proxy services  such as TOR. While this behavior can be legitimate  it?s often seen in malicious activities  when threat actors try to hide their source IP.",
    "MITRE tactics": "Defense Evasion",
    "Severity": "Medium",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_OperationFromSuspiciousProxyIP)"
  },
  {
    "Alert": "MicroBurst exploitation toolkit used to enumerate resources in your subscriptions",
    "Description": "A PowerShell script was run in your subscription and performed suspicious pattern of executing an information gathering operations to discover resources  permissions  and network structures. Threat actors use automated scripts  like MicroBurst  to gather information for malicious activities. This was detected by analyzing Azure Resource Manager operations in your subscription. This operation might indicate that an identity in your organization was breached  and that the threat actor is trying to compromise your environment for malicious intentions.",
    "MITRE tactics": "-",
    "Severity": "Low",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_MicroBurst.AzDomainInfo)"
  },
  {
    "Alert": "MicroBurst exploitation toolkit used to enumerate resources in your subscriptions",
    "Description": "A PowerShell script was run in your subscription and performed suspicious pattern of executing an information gathering operations to discover resources  permissions  and network structures. Threat actors use automated scripts  like MicroBurst  to gather information for malicious activities. This was detected by analyzing Azure Resource Manager operations in your subscription. This operation might indicate that an identity in your organization was breached  and that the threat actor is trying to compromise your environment for malicious intentions.",
    "MITRE tactics": "-",
    "Severity": "Low",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_MicroBurst.AzureDomainInfo)"
  },
  {
    "Alert": "MicroBurst exploitation toolkit used to execute code on your virtual machine",
    "Description": "A PowerShell script was run in your subscription and performed a suspicious pattern of executing code on a VM or a list of VMs. Threat actors use automated scripts  like MicroBurst  to run a script on a VM for malicious activities. This was detected by analyzing Azure Resource Manager operations in your subscription. This operation might indicate that an identity in your organization was breached  and that the threat actor is trying to compromise your environment for malicious intentions.",
    "MITRE tactics": "Execution",
    "Severity": "High",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_MicroBurst.AzVMBulkCMD)"
  },
  {
    "Alert": "MicroBurst exploitation toolkit used to execute code on your virtual machine",
    "Description": "MicroBurst?s exploitation toolkit was used to execute code on your virtual machines. This was detected by analyzing Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "-",
    "Severity": "High",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(RM_MicroBurst.AzureRmVMBulkCMD)"
  },
  {
    "Alert": "MicroBurst exploitation toolkit used to extract keys from your Azure key vaults",
    "Description": "A PowerShell script was run in your subscription and performed a suspicious pattern of extracting keys from an Azure Key Vault(s). Threat actors use automated scripts  like MicroBurst  to list keys and use them to access sensitive data or perform lateral movement. This was detected by analyzing Azure Resource Manager operations in your subscription. This operation might indicate that an identity in your organization was breached  and that the threat actor is trying to compromise your environment for malicious intentions.",
    "MITRE tactics": "-",
    "Severity": "High",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_MicroBurst.AzKeyVaultKeysREST)"
  },
  {
    "Alert": "MicroBurst exploitation toolkit used to extract keys to your storage accounts",
    "Description": "A PowerShell script was run in your subscription and performed a suspicious pattern of extracting keys to Storage Account(s). Threat actors use automated scripts  like MicroBurst  to list keys and use them to access sensitive data in your Storage Account(s). This was detected by analyzing Azure Resource Manager operations in your subscription. This operation might indicate that an identity in your organization was breached  and that the threat actor is trying to compromise your environment for malicious intentions.",
    "MITRE tactics": "Collection",
    "Severity": "High",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_MicroBurst.AZStorageKeysREST)"
  },
  {
    "Alert": "MicroBurst exploitation toolkit used to extract secrets from your Azure key vaults",
    "Description": "A PowerShell script was run in your subscription and performed a suspicious pattern of extracting secrets from an Azure Key Vault(s). Threat actors use automated scripts  like MicroBurst  to list secrets and use them to access sensitive data or perform lateral movement. This was detected by analyzing Azure Resource Manager operations in your subscription. This operation might indicate that an identity in your organization was breached  and that the threat actor is trying to compromise your environment for malicious intentions.",
    "MITRE tactics": "-",
    "Severity": "High",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_MicroBurst.AzKeyVaultSecretsREST)"
  },
  {
    "Alert": "PowerZure exploitation toolkit used to elevate access from Azure AD to Azure",
    "Description": "PowerZure exploitation toolkit was used to elevate access from AzureAD to Azure. This was detected by analyzing Azure Resource Manager operations in your tenant.",
    "MITRE tactics": "-",
    "Severity": "High",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_PowerZure.AzureElevatedPrivileges)"
  },
  {
    "Alert": "PowerZure exploitation toolkit used to enumerate resources",
    "Description": "PowerZure exploitation toolkit was used to enumerate resources on behalf of a legitimate user account in your organization. This was detected by analyzing Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "Collection",
    "Severity": "High",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_PowerZure.GetAzureTargets)"
  },
  {
    "Alert": "PowerZure exploitation toolkit used to enumerate storage containers  shares  and tables",
    "Description": "PowerZure exploitation toolkit was used to enumerate storage shares  tables  and containers. This was detected by analyzing Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "-",
    "Severity": "High",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_PowerZure.ShowStorageContent)"
  },
  {
    "Alert": "PowerZure exploitation toolkit used to execute a Runbook in your subscription",
    "Description": "PowerZure exploitation toolkit was used to execute a Runbook. This was detected by analyzing Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "-",
    "Severity": "High",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_PowerZure.StartRunbook)"
  },
  {
    "Alert": "PowerZure exploitation toolkit used to extract Runbooks content",
    "Description": "PowerZure exploitation toolkit was used to extract Runbook content. This was detected by analyzing Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "Collection",
    "Severity": "High",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_PowerZure.AzureRunbookContent)"
  },
  {
    "Alert": "PREVIEW - Azurite toolkit run detected",
    "Description": "A known cloud-environment reconnaissance toolkit run has been detected in your environment. The toolÿAzuriteÿcan be used by an attacker (or penetration tester) to map your subscriptions? resources and identify insecure configurations.",
    "MITRE tactics": "Collection",
    "Severity": "High",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_Azurite)"
  },
  {
    "Alert": "PREVIEW - Suspicious creation of compute resources detected",
    "Description": "Microsoft Defender for Resource Manager identified a suspicious creation of compute resources in your subscription utilizing Virtual Machines/Azure Scale Set. The identified operations are designed to allow administrators to efficiently manage their environments by deploying new resources when needed. While this activity may be legitimate  a threat actor might utilize such operations to conduct crypto mining.",
    "MITRE tactics": "Impact",
    "Severity": "Medium",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_SuspiciousComputeCreation)"
  },
  {
    "Alert": "PREVIEW - Suspicious key vault recovery detected",
    "Description": "Microsoft Defender for Resource Manager detected a suspicious recovery operation for a soft-deleted key vault resource.",
    "MITRE tactics": "Lateral movement",
    "Severity": "Medium/high",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(Arm_Suspicious_Vault_Recovering)"
  },
  {
    "Alert": "PREVIEW - Suspicious management session using an inactive account detected",
    "Description": "Subscription activity logs analysis has detected suspicious behavior. A principal not in use for a long period of time is now performing actions that can secure persistence for an attacker.",
    "MITRE tactics": "Persistence",
    "Severity": "Medium",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_UnusedAccountPersistence)"
  },
  {
    "Alert": "PREVIEW - Suspicious invocation of a high-risk ?Credential Access? operation by a service principal detected",
    "Description": "Microsoft Defender for Resource Manager identified a suspicious invocation of a high-risk operation in your subscription which might indicate an attempt to access credentials. The identified operations are designed to allow administrators to efficiently manage their environments. While this activity may be legitimate  a threat actor might utilize such operations to access restricted credentials and compromise resources in your environment. This can indicate that the service principal is compromised and is being used with malicious intent.",
    "MITRE tactics": "Credential access",
    "Severity": "Medium",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_AnomalousServiceOperation.CredentialAccess)"
  },
  {
    "Alert": "PREVIEW - Suspicious invocation of a high-risk ?Data Collection? operation by a service principal detected",
    "Description": "Microsoft Defender for Resource Manager identified a suspicious invocation of a high-risk operation in your subscription which might indicate an attempt to collect data. The identified operations are designed to allow administrators to efficiently manage their environments. While this activity may be legitimate  a threat actor might utilize such operations to collect sensitive data on resources in your environment. This can indicate that the service principal is compromised and is being used with malicious intent.",
    "MITRE tactics": "Collection",
    "Severity": "Medium",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_AnomalousServiceOperation.Collection)"
  },
  {
    "Alert": "PREVIEW - Suspicious invocation of a high-risk ?Defense Evasion? operation by a service principal detected",
    "Description": "Microsoft Defender for Resource Manager identified a suspicious invocation of a high-risk operation in your subscription which might indicate an attempt to evade defenses. The identified operations are designed to allow administrators to efficiently manage the security posture of their environments. While this activity may be legitimate  a threat actor might utilize such operations to avoid being detected while compromising resources in your environment. This can indicate that the service principal is compromised and is being used with malicious intent.",
    "MITRE tactics": "Defense Evasion",
    "Severity": "Medium",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_AnomalousServiceOperation.DefenseEvasion)"
  },
  {
    "Alert": "PREVIEW - Suspicious invocation of a high-risk ?Execution? operation by a service principal detected",
    "Description": "Microsoft Defender for Resource Manager identified a suspicious invocation of a high-risk operation on a machine in your subscription which might indicate an attempt to execute code. The identified operations are designed to allow administrators to efficiently manage their environments. While this activity may be legitimate  a threat actor might utilize such operations to access restricted credentials and compromise resources in your environment. This can indicate that the service principal is compromised and is being used with malicious intent.",
    "MITRE tactics": "Defense Execution",
    "Severity": "Medium",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_AnomalousServiceOperation.Execution)"
  },
  {
    "Alert": "PREVIEW - Suspicious invocation of a high-risk ?Impact? operation by a service principal detected",
    "Description": "Microsoft Defender for Resource Manager identified a suspicious invocation of a high-risk operation in your subscription which might indicate an attempted configuration change. The identified operations are designed to allow administrators to efficiently manage their environments. While this activity may be legitimate  a threat actor might utilize such operations to access restricted credentials and compromise resources in your environment. This can indicate that the service principal is compromised and is being used with malicious intent.",
    "MITRE tactics": "Impact",
    "Severity": "Medium",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_AnomalousServiceOperation.Impact)"
  },
  {
    "Alert": "PREVIEW - Suspicious invocation of a high-risk ?Initial Access? operation by a service principal detected",
    "Description": "Microsoft Defender for Resource Manager identified a suspicious invocation of a high-risk operation in your subscription which might indicate an attempt to access restricted resources. The identified operations are designed to allow administrators to efficiently access their environments. While this activity may be legitimate  a threat actor might utilize such operations to gain initial access to restricted resources in your environment. This can indicate that the service principal is compromised and is being used with malicious intent.",
    "MITRE tactics": "Initial access",
    "Severity": "Medium",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_AnomalousServiceOperation.InitialAccess)"
  },
  {
    "Alert": "PREVIEW - Suspicious invocation of a high-risk ?Lateral Movement Access? operation by a service principal detected",
    "Description": "Microsoft Defender for Resource Manager identified a suspicious invocation of a high-risk operation in your subscription which might indicate an attempt to perform lateral movement. The identified operations are designed to allow administrators to efficiently manage their environments. While this activity may be legitimate  a threat actor might utilize such operations to compromise more resources in your environment. This can indicate that the service principal is compromised and is being used with malicious intent.",
    "MITRE tactics": "Lateral movement",
    "Severity": "Medium",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_AnomalousServiceOperation.LateralMovement)"
  },
  {
    "Alert": "PREVIEW - Suspicious invocation of a high-risk ?persistence? operation by a service principal detected",
    "Description": "Microsoft Defender for Resource Manager identified a suspicious invocation of a high-risk operation in your subscription which might indicate an attempt to establish persistence. The identified operations are designed to allow administrators to efficiently manage their environments. While this activity may be legitimate  a threat actor might utilize such operations to establish persistence in your environment. This can indicate that the service principal is compromised and is being used with malicious intent.",
    "MITRE tactics": "Persistence",
    "Severity": "Medium",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_AnomalousServiceOperation.Persistence)"
  },
  {
    "Alert": "PREVIEW - Suspicious invocation of a high-risk ?Privilege Escalation? operation by a service principal detected",
    "Description": "Microsoft Defender for Resource Manager identified a suspicious invocation of a high-risk operation in your subscription which might indicate an attempt to escalate privileges. The identified operations are designed to allow administrators to efficiently manage their environments. While this activity may be legitimate  a threat actor might utilize such operations to escalate privileges while compromising resources in your environment. This can indicate that the service principal is compromised and is being used with malicious intent.",
    "MITRE tactics": "Privilege escalation",
    "Severity": "Medium",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_AnomalousServiceOperation.PrivilegeEscalation)"
  },
  {
    "Alert": "PREVIEW - Suspicious management session using an inactive account detected",
    "Description": "Subscription activity logs analysis has detected suspicious behavior. A principal not in use for a long period of time is now performing actions that can secure persistence for an attacker.",
    "MITRE tactics": "Persistence",
    "Severity": "Medium",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_UnusedAccountPersistence)"
  },
  {
    "Alert": "PREVIEW - Suspicious management session using PowerShell detected",
    "Description": "Subscription activity logs analysis has detected suspicious behavior. A principal that doesn?t regularly use PowerShell to manage the subscription environment is now using PowerShell  and performing actions that can secure persistence for an attacker.",
    "MITRE tactics": "Persistence",
    "Severity": "Medium",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_UnusedAppPowershellPersistence)"
  },
  {
    "Alert": "PREVIEW ? Suspicious management session using Azure portal detected",
    "Description": "Analysis of your subscription activity logs has detected a suspicious behavior. A principal that doesn?t regularly use the Azure portal (Ibiza) to manage the subscription environment (hasn?t used Azure portal to manage for the last 45 days  or a subscription that it is actively managing)  is now using the Azure portal and performing actions that can secure persistence for an attacker.",
    "MITRE tactics": "Persistence",
    "Severity": "Medium",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_UnusedAppIbizaPersistence)"
  },
  {
    "Alert": "Privileged custom role created for your subscription in a suspicious way (Preview)",
    "Description": "Microsoft Defender for Resource Manager detected a suspicious creation of privileged custom role definition in your subscription. This operation might have been performed by a legitimate user in your organization. Alternatively  it might indicate that an account in your organization was breached  and that the threat actor is trying to create a privileged role to use in the future to evade detection.",
    "MITRE tactics": "Privilege Escalation  Defense Evasion",
    "Severity": "Low",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_PrivilegedRoleDefinitionCreation)"
  },
  {
    "Alert": "Suspicious Azure role assignment detected (Preview)",
    "Description": "Microsoft Defender for Resource Manager identified a suspicious Azure role assignment / performed using PIM (Privileged Identity Management) in your tenant which might indicate that an account in your organization was compromised. The identified operations are designed to allow administrators to grant principals access to Azure resources. While this activity may be legitimate  a threat actor might utilize role assignment to escalate their permissions allowing them to advance their attack.",
    "MITRE tactics": "Lateral Movement  Defense Evasion",
    "Severity": "Low (PIM) / High",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_AnomalousRBACRoleAssignment)"
  },
  {
    "Alert": "Suspicious invocation of a high-risk ?Credential Access? operation detected (Preview)",
    "Description": "Microsoft Defender for Resource Manager identified a suspicious invocation of a high-risk operation in your subscription which might indicate an attempt to access credentials. The identified operations are designed to allow administrators to efficiently access their environments. While this activity may be legitimate  a threat actor might utilize such operations to access restricted credentials and compromise resources in your environment. This can indicate that the account is compromised and is being used with malicious intent.",
    "MITRE tactics": "Credential Access",
    "Severity": "Medium",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_AnomalousOperation.CredentialAccess)"
  },
  {
    "Alert": "Suspicious invocation of a high-risk ?Data Collection? operation detected (Preview)",
    "Description": "Microsoft Defender for Resource Manager identified a suspicious invocation of a high-risk operation in your subscription which might indicate an attempt to collect data. The identified operations are designed to allow administrators to efficiently manage their environments. While this activity may be legitimate  a threat actor might utilize such operations to collect sensitive data on resources in your environment. This can indicate that the account is compromised and is being used with malicious intent.",
    "MITRE tactics": "Collection",
    "Severity": "Medium",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_AnomalousOperation.Collection)"
  },
  {
    "Alert": "Suspicious invocation of a high-risk ?Defense Evasion? operation detected (Preview)",
    "Description": "Microsoft Defender for Resource Manager identified a suspicious invocation of a high-risk operation in your subscription which might indicate an attempt to evade defenses. The identified operations are designed to allow administrators to efficiently manage the security posture of their environments. While this activity may be legitimate  a threat actor might utilize such operations to avoid being detected while compromising resources in your environment. This can indicate that the account is compromised and is being used with malicious intent.",
    "MITRE tactics": "Defense Evasion",
    "Severity": "Medium",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_AnomalousOperation.DefenseEvasion)"
  },
  {
    "Alert": "Suspicious invocation of a high-risk ?Execution? operation detected (Preview)",
    "Description": "Microsoft Defender for Resource Manager identified a suspicious invocation of a high-risk operation on a machine in your subscription which might indicate an attempt to execute code. The identified operations are designed to allow administrators to efficiently manage their environments. While this activity may be legitimate  a threat actor might utilize such operations to access restricted credentials and compromise resources in your environment. This can indicate that the account is compromised and is being used with malicious intent.",
    "MITRE tactics": "Execution",
    "Severity": "Medium",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_AnomalousOperation.Execution)"
  },
  {
    "Alert": "Suspicious invocation of a high-risk ?Impact? operation detected (Preview)",
    "Description": "Microsoft Defender for Resource Manager identified a suspicious invocation of a high-risk operation in your subscription which might indicate an attempted configuration change. The identified operations are designed to allow administrators to efficiently manage their environments. While this activity may be legitimate  a threat actor might utilize such operations to access restricted credentials and compromise resources in your environment. This can indicate that the account is compromised and is being used with malicious intent.",
    "MITRE tactics": "Impact",
    "Severity": "Medium",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_AnomalousOperation.Impact)"
  },
  {
    "Alert": "Suspicious invocation of a high-risk ?Initial Access? operation detected (Preview)",
    "Description": "Microsoft Defender for Resource Manager identified a suspicious invocation of a high-risk operation in your subscription which might indicate an attempt to access restricted resources. The identified operations are designed to allow administrators to efficiently access their environments. While this activity may be legitimate  a threat actor might utilize such operations to gain initial access to restricted resources in your environment. This can indicate that the account is compromised and is being used with malicious intent.",
    "MITRE tactics": "Initial Access",
    "Severity": "Medium",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_AnomalousOperation.InitialAccess)"
  },
  {
    "Alert": "Suspicious invocation of a high-risk ?Lateral Movement? operation detected (Preview)",
    "Description": "Microsoft Defender for Resource Manager identified a suspicious invocation of a high-risk operation in your subscription which might indicate an attempt to perform lateral movement. The identified operations are designed to allow administrators to efficiently manage their environments. While this activity may be legitimate  a threat actor might utilize such operations to compromise more resources in your environment. This can indicate that the account is compromised and is being used with malicious intent.",
    "MITRE tactics": "Lateral Movement",
    "Severity": "Medium",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_AnomalousOperation.LateralMovement)"
  },
  {
    "Alert": "Suspicious invocation of a high-risk ?Persistence? operation detected (Preview)",
    "Description": "Microsoft Defender for Resource Manager identified a suspicious invocation of a high-risk operation in your subscription which might indicate an attempt to establish persistence. The identified operations are designed to allow administrators to efficiently manage their environments. While this activity may be legitimate  a threat actor might utilize such operations to establish persistence in your environment. This can indicate that the account is compromised and is being used with malicious intent.",
    "MITRE tactics": "Persistence",
    "Severity": "Medium",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_AnomalousOperation.Persistence)"
  },
  {
    "Alert": "Suspicious invocation of a high-risk ?Privilege Escalation? operation detected (Preview)",
    "Description": "Microsoft Defender for Resource Manager identified a suspicious invocation of a high-risk operation in your subscription which might indicate an attempt to escalate privileges. The identified operations are designed to allow administrators to efficiently manage their environments. While this activity may be legitimate  a threat actor might utilize such operations to escalate privileges while compromising resources in your environment. This can indicate that the account is compromised and is being used with malicious intent.",
    "MITRE tactics": "Privilege Escalation",
    "Severity": "Medium",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_AnomalousOperation.PrivilegeEscalation)"
  },
  {
    "Alert": "Usage of MicroBurst exploitation toolkit to run an arbitrary code or exfiltrate Azure Automation account credentials",
    "Description": "A PowerShell script was run in your subscription and performed a suspicious pattern of executing an arbitrary code or exfiltrate Azure Automation account credentials. Threat actors use automated scripts  like MicroBurst  to run arbitrary code for malicious activities. This was detected by analyzing Azure Resource Manager operations in your subscription. This operation might indicate that an identity in your organization was breached  and that the threat actor is trying to compromise your environment for malicious intentions.",
    "MITRE tactics": "Persistence  Credential Access",
    "Severity": "High",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_MicroBurst.RunCodeOnBehalf)"
  },
  {
    "Alert": "Usage of NetSPI techniques to maintain persistence in your Azure environment",
    "Description": "Usage of NetSPI persistence technique to create a webhook backdoor and maintain persistence in your Azure environment. This was detected by analyzing Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "-",
    "Severity": "High",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_NetSPI.MaintainPersistence)"
  },
  {
    "Alert": "Usage of PowerZure exploitation toolkit to run an arbitrary code or exfiltrate Azure Automation account credentials",
    "Description": "PowerZure exploitation toolkit detected attempting to run code or exfiltrate Azure Automation account credentials. This was detected by analyzing Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "-",
    "Severity": "High",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_PowerZure.RunCodeOnBehalf)"
  },
  {
    "Alert": "Usage of PowerZure function to maintain persistence in your Azure environment",
    "Description": "PowerZure exploitation toolkit detected creating a webhook backdoor to maintain persistence in your Azure environment. This was detected by analyzing Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "-",
    "Severity": "High",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_PowerZure.MaintainPersistence)"
  },
  {
    "Alert": "Suspicious classic role assignment detected (Preview)",
    "Description": "Microsoft Defender for Resource Manager identified a suspicious classic role assignment in your tenant which might indicate that an account in your organization was compromised. The identified operations are designed to provide backward compatibility with classic roles that are no longer commonly used. While this activity may be legitimate  a threat actor might utilize such assignment to grant permissions to another user account under their control.",
    "MITRE tactics": "Lateral Movement  Defense Evasion",
    "Severity": "High",
    "Alert Family": "Alerts for Resource Manager",
    "Alert Type ()": "(ARM_AnomalousClassicRoleAssignment)"
  },
  {
    "Alert": "Suspected brute force attack using a valid user",
    "Description": "A potential brute force attack has been detected on your resource. The attacker is using the valid user (username)  which has permissions to log in.",
    "MITRE tactics": "PreAttack",
    "Severity": "High",
    "Alert Family": "Alerts for open-source relational databases",
    "Alert Type ()": "(SQL.PostgreSQL_BruteForce SQL.MariaDB_BruteForce SQL.MySQL_BruteForce)"
  },
  {
    "Alert": "Suspected successful brute force attack",
    "Description": "A successful login occurred after an apparent brute force attack on your resource.",
    "MITRE tactics": "PreAttack",
    "Severity": "High",
    "Alert Family": "Alerts for open-source relational databases",
    "Alert Type ()": "(SQL.PostgreSQL_BruteForce SQL.MySQL_BruteForce SQL.MariaDB_BruteForce)"
  },
  {
    "Alert": "Suspected brute force attack",
    "Description": "A potential brute force attack has been detected on your resource.",
    "MITRE tactics": "PreAttack",
    "Severity": "High",
    "Alert Family": "Alerts for open-source relational databases",
    "Alert Type ()": "(SQL.PostgreSQL_BruteForce SQL.MySQL_BruteForce SQL.MariaDB_BruteForce)"
  },
  {
    "Alert": "Attempted logon by a potentially harmful application",
    "Description": "A potentially harmful application attempted to access your resource.",
    "MITRE tactics": "PreAttack",
    "Severity": "High",
    "Alert Family": "Alerts for open-source relational databases",
    "Alert Type ()": "(SQL.PostgreSQL_HarmfulApplication SQL.MariaDB_HarmfulApplication SQL.MySQL_HarmfulApplication)"
  },
  {
    "Alert": "Login from a principal user not seen in 60 days",
    "Description": "A principal user not seen in the last 60 days has logged into your database. If this database is new or this is expected behavior caused by recent changes in the users accessing the database  Defender for Cloud will identify significant changes to the access patterns and attempt to prevent future false positives.",
    "MITRE tactics": "Exploitation",
    "Severity": "Medium",
    "Alert Family": "Alerts for open-source relational databases",
    "Alert Type ()": "(SQL.PostgreSQL_PrincipalAnomaly SQL.MariaDB_PrincipalAnomaly SQL.MySQL_PrincipalAnomaly)"
  },
  {
    "Alert": "Login from a domain not seen in 60 days",
    "Description": "A user has logged in to your resource from a domain no other users have connected from in the last 60 days. If this resource is new or this is expected behavior caused by recent changes in the users accessing the resource  Defender for Cloud will identify significant changes to the access patterns and attempt to prevent future false positives.",
    "MITRE tactics": "Exploitation",
    "Severity": "Medium",
    "Alert Family": "Alerts for open-source relational databases",
    "Alert Type ()": "(SQL.MariaDB_DomainAnomaly SQL.PostgreSQL_DomainAnomaly SQL.MySQL_DomainAnomaly)"
  },
  {
    "Alert": "Log on from an unusual Azure Data Center",
    "Description": "Someone logged on to your resource from an unusual Azure Data Center.",
    "MITRE tactics": "Probing",
    "Severity": "Low",
    "Alert Family": "Alerts for open-source relational databases",
    "Alert Type ()": "(SQL.PostgreSQL_DataCenterAnomaly SQL.MariaDB_DataCenterAnomaly SQL.MySQL_DataCenterAnomaly)"
  },
  {
    "Alert": "Logon from an unusual cloud provider",
    "Description": "Someone logged on to your resource from a cloud provider not seen in the last 60 days. It's quick and easy for threat actors to obtain disposable compute power for use in their campaigns. If this is expected behavior caused by the recent adoption of a new cloud provider  Defender for Cloud will learn over time and attempt to prevent future false positives.",
    "MITRE tactics": "Exploitation",
    "Severity": "Medium",
    "Alert Family": "Alerts for open-source relational databases",
    "Alert Type ()": "(SQL.PostgreSQL_CloudProviderAnomaly SQL.MariaDB_CloudProviderAnomaly SQL.MySQL_CloudProviderAnomaly)"
  },
  {
    "Alert": "Log on from an unusual location",
    "Description": "Someone logged on to your resource from an unusual Azure Data Center.",
    "MITRE tactics": "Exploitation",
    "Severity": "Medium",
    "Alert Family": "Alerts for open-source relational databases",
    "Alert Type ()": "(SQL.MariaDB_GeoAnomaly SQL.PostgreSQL_GeoAnomaly SQL.MySQL_GeoAnomaly)"
  },
  {
    "Alert": "Login from a suspicious IP",
    "Description": "Your resource has been accessed successfully from an IP address that Microsoft Threat Intelligence has associated with suspicious activity.",
    "MITRE tactics": "PreAttack",
    "Severity": "Medium",
    "Alert Family": "Alerts for open-source relational databases",
    "Alert Type ()": "(SQL.PostgreSQL_SuspiciousIpAnomaly SQL.MariaDB_SuspiciousIpAnomaly SQL.MySQL_SuspiciousIpAnomaly)"
  },
  {
    "Alert": "A possible vulnerability to SQL Injection",
    "Description": "An application has generated a faulty SQL statement in the database. This can indicate a possible vulnerability to SQL injection attacks. There are two possible reasons for a faulty statement. A defect in application code might have constructed the faulty SQL statement. Or application code or stored procedures didn?t sanitize user input when constructing the faulty SQL statement which can be exploited for SQL injection.",
    "MITRE tactics": "PreAttack",
    "Severity": "Medium",
    "Alert Family": "Alerts for SQL Database and Azure Synapse Analytics",
    "Alert Type ()": "(SQL.DB_VulnerabilityToSqlInjection SQL.VM_VulnerabilityToSqlInjection SQL.MI_VulnerabilityToSqlInjection SQL.DW_VulnerabilityToSqlInjection Synapse.SQLPool_VulnerabilityToSqlInjection)"
  },
  {
    "Alert": "Attempted logon by a potentially harmful application",
    "Description": "A potentially harmful application attempted to access your resource.",
    "MITRE tactics": "PreAttack",
    "Severity": "High",
    "Alert Family": "Alerts for SQL Database and Azure Synapse Analytics",
    "Alert Type ()": "(SQL.DB_HarmfulApplication SQL.VM_HarmfulApplication SQL.MI_HarmfulApplication SQL.DW_HarmfulApplication Synapse.SQLPool_HarmfulApplication)"
  },
  {
    "Alert": "Log on from an unusual Azure Data Center",
    "Description": "There has been a change in the access pattern to an SQL Server where someone has signed in to the server from an unusual Azure Data Center. In some cases the alert detects a legitimate action (a new application or Azure service). In other cases the alert detects a malicious action (attacker operating from breached resource in Azure).",
    "MITRE tactics": "Probing",
    "Severity": "Low",
    "Alert Family": "Alerts for SQL Database and Azure Synapse Analytics",
    "Alert Type ()": "(SQL.DB_DataCenterAnomaly SQL.VM_DataCenterAnomaly SQL.DW_DataCenterAnomaly SQL.MI_DataCenterAnomaly Synapse.SQLPool_DataCenterAnomaly)"
  },
  {
    "Alert": "Log on from an unusual location",
    "Description": "There has been a change in the access pattern to SQL Server where someone has signed in to the server from an unusual geographical location. In some cases the alert detects a legitimate action (a new application or developer maintenance). In other cases the alert detects a malicious action (a former employee or external attacker).",
    "MITRE tactics": "Exploitation",
    "Severity": "Medium",
    "Alert Family": "Alerts for SQL Database and Azure Synapse Analytics",
    "Alert Type ()": "(SQL.DB_GeoAnomaly SQL.VM_GeoAnomaly SQL.DW_GeoAnomaly SQL.MI_GeoAnomaly Synapse.SQLPool_GeoAnomaly)"
  },
  {
    "Alert": "Login from a principal user not seen in 60 days",
    "Description": "A principal user not seen in the last 60 days has logged into your database. If this database is new or this is expected behavior caused by recent changes in the users accessing the database Defender for Cloud will identify significant changes to the access patterns and attempt to prevent future false positives.",
    "MITRE tactics": "Exploitation",
    "Severity": "Medium",
    "Alert Family": "Alerts for SQL Database and Azure Synapse Analytics",
    "Alert Type ()": "(SQL.DB_PrincipalAnomaly SQL.VM_PrincipalAnomaly SQL.DW_PrincipalAnomaly SQL.MI_PrincipalAnomaly Synapse.SQLPool_PrincipalAnomaly)"
  },
  {
    "Alert": "Login from a domain not seen in 60 days",
    "Description": "A user has logged in to your resource from a domain no other users have connected from in the last 60 days. If this resource is new or this is expected behavior caused by recent changes in the users accessing the resource Defender for Cloud will identify significant changes to the access patterns and attempt to prevent future false positives.",
    "MITRE tactics": "Exploitation",
    "Severity": "Medium",
    "Alert Family": "Alerts for SQL Database and Azure Synapse Analytics",
    "Alert Type ()": "(SQL.DB_DomainAnomaly SQL.VM_DomainAnomaly SQL.DW_DomainAnomaly SQL.MI_DomainAnomaly Synapse.SQLPool_DomainAnomaly)"
  },
  {
    "Alert": "Login from a suspicious IP",
    "Description": "Your resource has been accessed successfully from an IP address that Microsoft Threat Intelligence has associated with suspicious activity.",
    "MITRE tactics": "PreAttack",
    "Severity": "Medium",
    "Alert Family": "Alerts for SQL Database and Azure Synapse Analytics",
    "Alert Type ()": "(SQL.DB_SuspiciousIpAnomaly SQL.VM_SuspiciousIpAnomaly SQL.DW_SuspiciousIpAnomaly SQL.MI_SuspiciousIpAnomaly Synapse.SQLPool_SuspiciousIpAnomaly)"
  },
  {
    "Alert": "Potential SQL injection",
    "Description": "An active exploit has occurred against an identified application vulnerable to SQL injection. This means an attacker is trying to inject malicious SQL statements by using the vulnerable application code or stored procedures.",
    "MITRE tactics": "PreAttack",
    "Severity": "High",
    "Alert Family": "Alerts for SQL Database and Azure Synapse Analytics",
    "Alert Type ()": "(SQL.DB_PotentialSqlInjection SQL.VM_PotentialSqlInjection SQL.MI_PotentialSqlInjection SQL.DW_PotentialSqlInjection Synapse.SQLPool_PotentialSqlInjection)"
  },
  {
    "Alert": "Suspected brute force attack using a valid user",
    "Description": "A potential brute force attack has been detected on your resource. The attacker is using the valid user (username) which has permissions to log in.",
    "MITRE tactics": "PreAttack",
    "Severity": "High",
    "Alert Family": "Alerts for SQL Database and Azure Synapse Analytics",
    "Alert Type ()": "(SQL.DB_BruteForce SQL.VM_BruteForce SQL.DW_BruteForce SQL.MI_BruteForce Synapse.SQLPool_BruteForce)"
  },
  {
    "Alert": "Suspected brute force attack",
    "Description": "A potential brute force attack has been detected on your resource.",
    "MITRE tactics": "PreAttack",
    "Severity": "High",
    "Alert Family": "Alerts for SQL Database and Azure Synapse Analytics",
    "Alert Type ()": "(SQL.DB_BruteForce SQL.VM_BruteForce SQL.DW_BruteForce SQL.MI_BruteForce Synapse.SQLPool_BruteForce)"
  },
  {
    "Alert": "Suspected successful brute force attack",
    "Description": "A successful login occurred after an apparent brute force attack on your resource.",
    "MITRE tactics": "PreAttack",
    "Severity": "High",
    "Alert Family": "Alerts for SQL Database and Azure Synapse Analytics",
    "Alert Type ()": "(SQL.DB_BruteForce SQL.VM_BruteForce SQL.DW_BruteForce SQL.MI_BruteForce Synapse.SQLPool_BruteForce)"
  },
  {
    "Alert": "SQL Server potentially spawned a Windows command shell and accessed an abnormal external source",
    "Description": "A suspicious SQL statement potentially spawned a Windows command shell with an external source that hasn?t been seen before. Executing a shell that accesses an external source is a method used by attackers to download malicious payload and then execute it on the machine and compromise it. This enables an attacker to perform malicious tasks under remote direction. Alternatively accessing an external source can be used to exfiltrate data to an external destination.",
    "MITRE tactics": "Execution",
    "Severity": "High",
    "Alert Family": "Alerts for SQL Database and Azure Synapse Analytics",
    "Alert Type ()": "(SQL.DB_ShellExternalSourceAnomaly SQL.MI_ShellExternalSourceAnomaly SQL.DW_ShellExternalSourceAnomaly SQL.VM_ShellExternalSourceAnomaly Synapse.SQLPool_ShellExternalSourceAnomaly)"
  },
  {
    "Alert": "Unusual payload with obfuscated parts has been initiated by SQL Server",
    "Description": "Someone has initiated a new payload utilizing the layer in SQL Server that communicates with the operating system while concealing the command in the SQL query. Attackers commonly hide impactful commands which are popularly monitored like xp_cmdshell sp_add_job and others. Obfuscation techniques abuse legitimate commands like string concatenation casting base changing and others to avoid regex detection and hurt the readability of the logs.",
    "MITRE tactics": "Execution",
    "Severity": "High",
    "Alert Family": "Alerts for SQL Database and Azure Synapse Analytics",
    "Alert Type ()": "(SQL.VM_PotentialSqlInjection)"
  },
  {
    "Alert": "Exposed Postgres service with trust authentication configuration in Kubernetes detected (Preview)",
    "Description": "Kubernetes cluster configuration analysis detected exposure of a Postgres service by a load balancer. The service is configured with trust authentication method  which doesn?t require credentials.",
    "MITRE tactics": "InitialAccess",
    "Severity": "Medium",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S_ExposedPostgresTrustAuth)"
  },
  {
    "Alert": "Exposed Postgres service with risky configuration in Kubernetes detected (Preview)",
    "Description": "Kubernetes cluster configuration analysis detected exposure of a Postgres service by a load balancer with a risky configuration. Exposing the service to a wide range of IP addresses poses a security risk.",
    "MITRE tactics": "InitialAccess",
    "Severity": "Medium",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S_ExposedPostgresBroadIPRange)"
  },
  {
    "Alert": "Attempt to create a new Linux namespace from a container detected",
    "Description": "Analysis of processes running within a container in Kubernetes cluster detected an attempt to create a new Linux namespace. While this behavior might be legitimate  it might indicate that an attacker tries to escape from the container to the node. Some CVE-2022-0185 exploitations use this technique.",
    "MITRE tactics": "PrivilegeEscalation",
    "Severity": "Medium",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_NamespaceCreation)"
  },
  {
    "Alert": "A history file has been cleared",
    "Description": "Analysis of processes running within a container or directly on a Kubernetes node  has detected that the command history log file has been cleared. Attackers may do this to cover their tracks. The operation was performed by the specified user account.",
    "MITRE tactics": "DefenseEvasion",
    "Severity": "Medium",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_HistoryFileCleared)"
  },
  {
    "Alert": "Abnormal activity of managed identity associated with Kubernetes (Preview)",
    "Description": "Analysis of Azure Resource Manager operations detected an abnormal behavior of a managed identity used by an AKS addon. The detected activity isn?t consistent with the behavior of the associated addon. While this activity can be legitimate  such behavior might indicate that the identity was gained by an attacker  possibly from a compromised container in the Kubernetes cluster.",
    "MITRE tactics": "Lateral Movement",
    "Severity": "Medium",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S_AbnormalMiActivity)"
  },
  {
    "Alert": "Abnormal Kubernetes service account operation detected",
    "Description": "Kubernetes audit log analysis detected abnormal behavior by a service account in your Kubernetes cluster. The service account was used for an operation  which isn?t common for this service account. While this activity can be legitimate  such behavior might indicate that the service account is being used for malicious purposes.",
    "MITRE tactics": "Lateral Movement  Credential Access",
    "Severity": "Medium",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S_ServiceAccountRareOperation)"
  },
  {
    "Alert": "An uncommon connection attempt detected",
    "Description": "Analysis of processes running within a container or directly on a Kubernetes node  has detected an uncommon connection attempt utilizing a socks protocol. This is very rare in normal operations  but a known technique for attackers attempting to bypass network-layer detections.",
    "MITRE tactics": "Execution  Exfiltration  Exploitation",
    "Severity": "Medium",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_SuspectConnection)"
  },
  {
    "Alert": "Anomalous pod deployment (Preview)",
    "Description": "Kubernetes audit log analysis detected pod deployment which is anomalous based on previous pod deployment activity. This activity is considered an anomaly when taking into account how the different features seen in the deployment operation are in relations to one another. The features monitored include the container image registry used  the account performing the deployment  day of the week  how often this account performs pod deployments  user agent used in the operation  whether this is a namespace to which pod deployments often occur  and other features. Top contributing reasons for raising this alert as anomalous activity are detailed under the alert?s extended properties.",
    "MITRE tactics": "Execution",
    "Severity": "Medium",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S_AnomalousPodDeployment)ÿ"
  },
  {
    "Alert": "Anomalous secret access (Preview)",
    "Description": "Kubernetes audit log analysis detected secret access request which is anomalous based on previous secret access activity. This activity is considered an anomaly when taking into account how the different features seen in the secret access operation are in relations to one another. The features monitored by this analytics include the user name used  the name of the secret  the name of the namespace  user agent used in the operation  or other features. Top contributing reasons for raising this alert as anomalous activity are detailed under the alert extended properties.",
    "MITRE tactics": "CredentialAccess",
    "Severity": "Medium",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": ""
  },
  {
    "Alert": "Attempt to stop apt-daily-upgrade.timer service detected",
    "Description": "Analysis of processes running within a container or directly on a Kubernetes node  has detected an attempt to stop apt-daily-upgrade.timer service. Attackers have been observed stopping this service to download malicious files and grant execution privileges for their attacks. This activity can also happen if the service is updated through normal administrative actions.",
    "MITRE tactics": "DefenseEvasion",
    "Severity": "Informational",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_TimerServiceDisabled)"
  },
  {
    "Alert": "Behavior similar to common Linux bots detected (Preview)",
    "Description": "Analysis of processes running within a container or directly on a Kubernetes node  has detected the execution of a process normally associated with common Linux botnets.",
    "MITRE tactics": "Execution  Collection  Command And Control",
    "Severity": "Medium",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_CommonBot)"
  },
  {
    "Alert": "Behavior similar to Fairware ransomware detected",
    "Description": "Analysis of processes running within a container detected the execution of rm -rf commands applied to suspicious locations. As rm -rf will recursively delete files  it is normally used on discrete folders. In this case  it is being used in a location that could remove a lot of data. Fairware ransomware is known to execute rm -rf commands in this folder.",
    "MITRE tactics": "Execution",
    "Severity": "Medium",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_FairwareMalware)"
  },
  {
    "Alert": "Command within a container running with high privileges",
    "Description": "Machine logs indicate that a privileged command was run in a Docker container. A privileged command has extended privileges on the host machine.",
    "MITRE tactics": "PrivilegeEscalation",
    "Severity": "Low",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_PrivilegedExecutionInContainer)"
  },
  {
    "Alert": "Container running in privileged mode",
    "Description": "Analysis of processes running within a container or directly on a Kubernetes node  has detected the execution of a Docker command that is running a privileged container. The privileged container has full access to the hosting pod or host resource. If compromised  an attacker may use the privileged container to gain access to the hosting pod or host.",
    "MITRE tactics": "PrivilegeEscalation  Execution",
    "Severity": "Low",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_PrivilegedContainerArtifacts)"
  },
  {
    "Alert": "Container with a sensitive volume mount detected",
    "Description": "Kubernetes audit log analysis detected a new container with a sensitive volume mount. The volume that was detected is a hostPath type which mounts a sensitive file or folder from the node to the container. If the container gets compromised  the attacker can use this mount for gaining access to the node.",
    "MITRE tactics": "Privilege Escalation",
    "Severity": "Medium",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S_SensitiveMount)"
  },
  {
    "Alert": "CoreDNS modification in Kubernetes detected",
    "Description": "Kubernetes audit log analysis detected a modification of the CoreDNS configuration. The configuration of CoreDNS can be modified by overriding its configmap. While this activity can be legitimate  if attackers have permissions to modify the configmap  they can change the behavior of the cluster?s DNS server and poison it.",
    "MITRE tactics": "Lateral Movement",
    "Severity": "Low",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S_CoreDnsModification)"
  },
  {
    "Alert": "Creation of admission webhook configuration detected",
    "Description": "Kubernetes audit log analysis detected a new admission webhook configuration. Kubernetes has two built-in generic admission controllers: MutatingAdmissionWebhook and ValidatingAdmissionWebhook. The behavior of these admission controllers is determined by an admission webhook that the user deploys to the cluster. The usage of such admission controllers can be legitimate  however attackers can use such webhooks for modifying the requests (in case of MutatingAdmissionWebhook) or inspecting the requests and gain sensitive information (in case of ValidatingAdmissionWebhook).",
    "MITRE tactics": "Credential Access  Persistence",
    "Severity": "Low",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S_AdmissionController)"
  },
  {
    "Alert": "Detected file download from a known malicious source",
    "Description": "Analysis of processes running within a container or directly on a Kubernetes node  has detected a download of a file from a source frequently used to distribute malware.",
    "MITRE tactics": "PrivilegeEscalation  Execution  Exfiltration  Command And Control",
    "Severity": "Medium",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_SuspectDownload)"
  },
  {
    "Alert": "Detected suspicious file download",
    "Description": "Analysis of processes running within a container or directly on a Kubernetes node  has detected a suspicious download of a remote file.",
    "MITRE tactics": "Persistence",
    "Severity": "Low",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_SuspectDownloadArtifacts)"
  },
  {
    "Alert": "Detected suspicious use of the nohup command",
    "Description": "Analysis of processes running within a container or directly on a Kubernetes node  has detected a suspicious use of the nohup command. Attackers have been seen using the command nohup to run hidden files from a temporary directory to allow their executables to run in the background. It?s rare to see this command run on hidden files located in a temporary directory.",
    "MITRE tactics": "Persistence  DefenseEvasion",
    "Severity": "Medium",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_SuspectNohup)"
  },
  {
    "Alert": "Detected suspicious use of the useradd command",
    "Description": "Analysis of processes running within a container or directly on a Kubernetes node  has detected a suspicious use of the useradd command.",
    "MITRE tactics": "Persistence",
    "Severity": "Medium",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_SuspectUserAddition)"
  },
  {
    "Alert": "Digital currency mining container detected",
    "Description": "Kubernetes audit log analysis detected a container that has an image associated with a digital currency mining tool.",
    "MITRE tactics": "Execution",
    "Severity": "High",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S_MaliciousContainerImage)"
  },
  {
    "Alert": "Digital currency mining related behavior detected",
    "Description": "Analysis of processes running within a container or directly on a Kubernetes node  has detected an execution of a process or command normally associated with digital currency mining.",
    "MITRE tactics": "Execution",
    "Severity": "High",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_DigitalCurrencyMining)"
  },
  {
    "Alert": "Docker build operation detected on a Kubernetes node",
    "Description": "Analysis of processes running within a container or directly on a Kubernetes node  has detected a build operation of a container image on a Kubernetes node. While this behavior might be legitimate  attackers might build their malicious images locally to avoid detection.",
    "MITRE tactics": "DefenseEvasion",
    "Severity": "Low",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_ImageBuildOnNode)"
  },
  {
    "Alert": "Excessive role permissions assigned in Kubernetes cluster (Preview)",
    "Description": "Analysis of the Kubernetes audit logs detected an excessive permissions role assignment to your cluster. The listed permissions for the assigned roles are uncommon to the specific service account. This detection considers previous role assignments to the same service account across clusters monitored by Azure  volume per permission  and the impact of the specific permission. The anomaly detection model used for this alert takes into account how this permission is used across all clusters monitored by Microsoft Defender for Cloud.",
    "MITRE tactics": "Privilege Escalation",
    "Severity": "Low",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S_ServiceAcountPermissionAnomaly)"
  },
  {
    "Alert": "Executable found running from a suspicious location (Preview)",
    "Description": "Analysis of processes running within a container or directly on a Kubernetes node  has detected an executable file that is running from a location associated with known suspicious files. This executable could either be legitimate activity  or an indication of a compromised system.",
    "MITRE tactics": "Execution",
    "Severity": "Medium",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_SuspectExecutablePath)"
  },
  {
    "Alert": "Exposed Kubeflow dashboard detected",
    "Description": "The Kubernetes audit log analysis detected exposure of the Istio Ingress by a load balancer in a cluster that runs Kubeflow. This action might expose the Kubeflow dashboard to the internet. If the dashboard is exposed to the internet  attackers can access it and run malicious containers or code on the cluster. Find more details in the following article:ÿhttps://aka.ms/exposedkubeflow-blog",
    "MITRE tactics": "Initial Access",
    "Severity": "Medium",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S_ExposedKubeflow)"
  },
  {
    "Alert": "Exposed Kubernetes dashboard detected",
    "Description": "Kubernetes audit log analysis detected exposure of the Kubernetes Dashboard by a LoadBalancer service. Exposed dashboard allows an unauthenticated access to the cluster management and poses a security threat.",
    "MITRE tactics": "Initial Access",
    "Severity": "High",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S_ExposedDashboard)"
  },
  {
    "Alert": "Exposed Kubernetes service detected",
    "Description": "The Kubernetes audit log analysis detected exposure of a service by a load balancer. This service is related to a sensitive application that allows high impact operations in the cluster such as running processes on the node or creating new containers. In some cases  this service doesn?t require authentication. If the service doesn?t require authentication  exposing it to the internet poses a security risk.",
    "MITRE tactics": "Initial Access",
    "Severity": "Medium",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S_ExposedService)"
  },
  {
    "Alert": "Exposed Redis service in AKS detected",
    "Description": "The Kubernetes audit log analysis detected exposure of a Redis service by a load balancer. If the service doesn?t require authentication  exposing it to the internet poses a security risk.",
    "MITRE tactics": "Initial Access",
    "Severity": "Low",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S_ExposedRedis)"
  },
  {
    "Alert": "Indicators associated with DDOS toolkit detected",
    "Description": "Analysis of processes running within a container or directly on a Kubernetes node  has detected file names that are part of a toolkit associated with malware capable of launching DDoS attacks  opening ports and services  and taking full control over the infected system. This could also possibly be legitimate activity.",
    "MITRE tactics": "Persistence  LateralMovement  Execution  Exploitation",
    "Severity": "Medium",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_KnownLinuxDDoSToolkit)"
  },
  {
    "Alert": "K8S API requests from proxy IP address detected",
    "Description": "Kubernetes audit log analysis detected API requests to your cluster from an IP address that is associated with proxy services  such as TOR. While this behavior can be legitimate  it?s often seen in malicious activities  when attackers try to hide their source IP.",
    "MITRE tactics": "Execution",
    "Severity": "Low",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S_TI_Proxy)"
  },
  {
    "Alert": "Kubernetes events deleted",
    "Description": "Defender for Cloud detected that some Kubernetes events have been deleted. Kubernetes events are objects in Kubernetes that contain information about changes in the cluster. Attackers might delete those events for hiding their operations in the cluster.",
    "MITRE tactics": "Defense Evasion",
    "Severity": "Low",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S_DeleteEvents)"
  },
  {
    "Alert": "Kubernetes penetration testing tool detected",
    "Description": "Kubernetes audit log analysis detected usage of Kubernetes penetration testing tool in the AKS cluster. While this behavior can be legitimate  attackers might use such public tools for malicious purposes.",
    "MITRE tactics": "Execution",
    "Severity": "Low",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S_PenTestToolsKubeHunter)"
  },
  {
    "Alert": "Manipulation of host firewall detected",
    "Description": "Analysis of processes running within a container or directly on a Kubernetes node  has detected a possible manipulation of the on-host firewall. Attackers will often disable this to exfiltrate data.",
    "MITRE tactics": "DefenseEvasion  Exfiltration",
    "Severity": "Medium",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_FirewallDisabled)"
  },
  {
    "Alert": "Microsoft Defender for Cloud test alert (not a threat).",
    "Description": "This is a test alert generated by Microsoft Defender for Cloud. No further action is needed.",
    "MITRE tactics": "Execution",
    "Severity": "High",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_EICAR)"
  },
  {
    "Alert": "New container in the kube-system namespace detected",
    "Description": "Kubernetes audit log analysis detected a new container in the kube-system namespace that isn?t among the containers that normally run in this namespace. The kube-system namespaces shouldn?t contain user resources. Attackers can use this namespace for hiding malicious components.",
    "MITRE tactics": "Persistence",
    "Severity": "Low",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S_KubeSystemContainer)"
  },
  {
    "Alert": "New high privileges role detected",
    "Description": "Kubernetes audit log analysis detected a new role with high privileges. A binding to a role with high privileges gives the user\\group high privileges in the cluster. Unnecessary privileges might cause privilege escalation in the cluster.",
    "MITRE tactics": "Persistence",
    "Severity": "Low",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S_HighPrivilegesRole)"
  },
  {
    "Alert": "Possible attack tool detected",
    "Description": "Analysis of processes running within a container or directly on a Kubernetes node  has detected a suspicious tool invocation. This tool is often associated with malicious users attacking others.",
    "MITRE tactics": "Execution  Collection  Command And Control  Probing",
    "Severity": "Medium",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_KnownLinuxAttackTool)"
  },
  {
    "Alert": "Possible backdoor detected",
    "Description": "Analysis of processes running within a container or directly on a Kubernetes node  has detected a suspicious file being downloaded and run. This activity has previously been associated with installation of a backdoor.",
    "MITRE tactics": "Persistence  DefenseEvasion  Execution  Exploitation",
    "Severity": "Medium",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_LinuxBackdoorArtifact)"
  },
  {
    "Alert": "Possible command line exploitation attempt",
    "Description": "Analysis of processes running within a container or directly on a Kubernetes node  has detected a possible exploitation attempt against a known vulnerability.",
    "MITRE tactics": "Exploitation",
    "Severity": "Medium",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_ExploitAttempt)"
  },
  {
    "Alert": "Possible credential access tool detected",
    "Description": "Analysis of processes running within a container or directly on a Kubernetes node  has detected a possible known credential access tool was running on the container  as identified by the specified process and commandline history item. This tool is often associated with attacker attempts to access credentials.",
    "MITRE tactics": "CredentialAccess",
    "Severity": "Medium",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_KnownLinuxCredentialAccessTool)"
  },
  {
    "Alert": "Possible Cryptocoinminer download detected",
    "Description": "Analysis of processes running within a container or directly on a Kubernetes node  has detected download of a file normally associated with digital currency mining.",
    "MITRE tactics": "DefenseEvasion  Command And Control  Exploitation",
    "Severity": "Medium",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_CryptoCoinMinerDownload)"
  },
  {
    "Alert": "Possible data exfiltration detected",
    "Description": "Analysis of processes running within a container or directly on a Kubernetes node  has detected a possible data egress condition. Attackers will often egress data from machines they have compromised.",
    "MITRE tactics": "Collection  Exfiltration",
    "Severity": "Medium",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_DataEgressArtifacts)"
  },
  {
    "Alert": "Possible Log Tampering Activity Detected",
    "Description": "Analysis of processes running within a container or directly on a Kubernetes node  has detected a possible removal of files that tracks user?s activity during the course of its operation. Attackers often try to evade detection and leave no trace of malicious activities by deleting such log files.",
    "MITRE tactics": "DefenseEvasion",
    "Severity": "Medium",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_SystemLogRemoval)"
  },
  {
    "Alert": "Possible password change using crypt-method detected",
    "Description": "Analysis of processes running within a container or directly on a Kubernetes node  has detected a password change using the crypt method. Attackers can make this change to continue access and gain persistence after compromise.",
    "MITRE tactics": "CredentialAccess",
    "Severity": "Medium",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_SuspectPasswordChange)"
  },
  {
    "Alert": "Potential port forwarding to external IP address",
    "Description": "Analysis of processes running within a container or directly on a Kubernetes node  has detected an initiation of port forwarding to an external IP address.",
    "MITRE tactics": "Exfiltration  Command And Control",
    "Severity": "Medium",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_SuspectPortForwarding)"
  },
  {
    "Alert": "Potential reverse shell detected",
    "Description": "Analysis of processes running within a container or directly on a Kubernetes node  has detected a potential reverse shell. These are used to get a compromised machine to call back into a machine an attacker owns.",
    "MITRE tactics": "Exfiltration  Exploitation",
    "Severity": "Medium",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_ReverseShell)"
  },
  {
    "Alert": "Privileged container detected",
    "Description": "Kubernetes audit log analysis detected a new privileged container. A privileged container has access to the node?s resources and breaks the isolation between containers. If compromised  an attacker can use the privileged container to gain access to the node.",
    "MITRE tactics": "Privilege Escalation",
    "Severity": "Low",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S_PrivilegedContainer)"
  },
  {
    "Alert": "Process associated with digital currency mining detected",
    "Description": "Analysis of processes running within a container detected the execution of a process normally associated with digital currency mining.",
    "MITRE tactics": "Execution  Exploitation",
    "Severity": "Medium",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_CryptoCoinMinerArtifacts)"
  },
  {
    "Alert": "Process seen accessing the SSH authorized keys file in an unusual way",
    "Description": "An SSH authorized_keys file was accessed in a method similar to known malware campaigns. This access could signify that an actor is attempting to gain persistent access to a machine.",
    "MITRE tactics": "Unknown",
    "Severity": "Low",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_SshKeyAccess)"
  },
  {
    "Alert": "Role binding to the cluster-admin role detected",
    "Description": "Kubernetes audit log analysis detected a new binding to the cluster-admin role which gives administrator privileges. Unnecessary administrator privileges might cause privilege escalation in the cluster.",
    "MITRE tactics": "Persistence",
    "Severity": "Low",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S_ClusterAdminBinding)"
  },
  {
    "Alert": "Security-related process termination detected",
    "Description": "Analysis of processes running within a container or directly on a Kubernetes node  has detected an attempt to terminate processes related to security monitoring on the container. Attackers will often try to terminate such processes using predefined scripts post-compromise.",
    "MITRE tactics": "Persistence",
    "Severity": "Low",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_SuspectProcessTermination)"
  },
  {
    "Alert": "SSH server is running inside a container",
    "Description": "Analysis of processes running within a container detected an SSH server running inside the container.",
    "MITRE tactics": "Execution",
    "Severity": "Medium",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_ContainerSSH)"
  },
  {
    "Alert": "Suspicious file timestamp modification",
    "Description": "Analysis of processes running within a container or directly on a Kubernetes node  has detected a suspicious timestamp modification. Attackers will often copy timestamps from existing legitimate files to new tools to avoid detection of these newly dropped files.",
    "MITRE tactics": "Persistence  DefenseEvasion",
    "Severity": "Low",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_TimestampTampering)"
  },
  {
    "Alert": "Suspicious request to Kubernetes API",
    "Description": "Analysis of processes running within a container indicates that a suspicious request was made to the Kubernetes API. The request was sent from a container in the cluster. Although this behavior can be intentional  it might indicate that a compromised container is running in the cluster.",
    "MITRE tactics": "LateralMovement",
    "Severity": "Medium",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_KubernetesAPI)"
  },
  {
    "Alert": "Suspicious request to the Kubernetes Dashboard",
    "Description": "Analysis of processes running within a container indicates that a suspicious request was made to the Kubernetes Dashboard. The request was sent from a container in the cluster. Although this behavior can be intentional  it might indicate that a compromised container is running in the cluster.",
    "MITRE tactics": "LateralMovement",
    "Severity": "Medium",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_KubernetesDashboard)"
  },
  {
    "Alert": "Potential crypto coin miner started",
    "Description": "Analysis of processes running within a container or directly on a Kubernetes node  has detected a process being started in a way normally associated with digital currency mining.",
    "MITRE tactics": "Execution",
    "Severity": "Medium",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_CryptoCoinMinerExecution)"
  },
  {
    "Alert": "Suspicious password access",
    "Description": "Analysis of processes running within a container or directly on a Kubernetes node  has detected suspicious attempt to access encrypted user passwords.",
    "MITRE tactics": "Persistence",
    "Severity": "Informational",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_SuspectPasswordFileAccess)"
  },
  {
    "Alert": "Suspicious use of DNS over HTTPS",
    "Description": "Analysis of processes running within a container or directly on a Kubernetes node  has detected the use of a DNS call over HTTPS in an uncommon fashion. This technique is used by attackers to hide calls out to suspect or malicious sites.",
    "MITRE tactics": "DefenseEvasion  Exfiltration",
    "Severity": "Medium",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_SuspiciousDNSOverHttps)"
  },
  {
    "Alert": "A possible connection to malicious location has been detected.",
    "Description": "Analysis of processes running within a container or directly on a Kubernetes node  has detected a connection to a location that has been reported to be malicious or unusual. This is an indicator that a compromise may have occurred.",
    "MITRE tactics": "InitialAccess",
    "Severity": "Medium",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_ThreatIntelCommandLineSuspectDomain)"
  },
  {
    "Alert": "Possible malicious web shell detected.",
    "Description": "Analysis of processes running within a container detected a possible web shell. Attackers will often upload a web shell to a compute resource they have compromised to gain persistence or for further exploitation.",
    "MITRE tactics": "Persistence  Exploitation",
    "Severity": "Medium",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_Webshell)"
  },
  {
    "Alert": "Burst of multiple reconnaissance commands could indicate initial activity after compromise",
    "Description": "Analysis of host/device data detected execution of multiple reconnaissance commands related to gathering system or host details performed by attackers after initial compromise.",
    "MITRE tactics": "Discovery  Collection",
    "Severity": "Low",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_ReconnaissanceArtifactsBurst)"
  },
  {
    "Alert": "Suspicious Download Then Run Activity",
    "Description": "Analysis of processes running within a container or directly on a Kubernetes node  has detected a file being downloaded then run in the same command. While this isn?t always malicious  this is a very common technique attackers use to get malicious files onto victim machines.",
    "MITRE tactics": "Execution  CommandAndControl  Exploitation",
    "Severity": "Medium",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_DownloadAndRunCombo)"
  },
  {
    "Alert": "Digital currency mining activity",
    "Description": "Analysis of DNS transactions detected digital currency mining activity. Such activity  while possibly legitimate user behavior  is frequently performed by attackers following compromise of resources. Typical related attacker activity is likely to include the download and execution of common mining tools.",
    "MITRE tactics": "Exfiltration",
    "Severity": "Low",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_CurrencyMining)"
  },
  {
    "Alert": "Access to kubelet kubeconfig file detected",
    "Description": "Analysis of processes running on a Kubernetes cluster node detected access to kubeconfig file on the host. The kubeconfig file  normally used by the Kubelet process  contains credentials to the Kubernetes cluster API server. Access to this file is often associated with attackers attempting to access those credentials  or with security scanning tools which check if the file is accessible.",
    "MITRE tactics": "CredentialAccess",
    "Severity": "Medium",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_KubeConfigAccess)"
  },
  {
    "Alert": "Access to cloud metadata service detected",
    "Description": "Analysis of processes running within a container detected access to the cloud metadata service for acquiring identity token. The container doesn?t normally perform such operation. While this behavior might be legitimate  attackers might use this technique to access cloud resources after gaining initial access to a running container.",
    "MITRE tactics": "CredentialAccess",
    "Severity": "Medium",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_ImdsCall)"
  },
  {
    "Alert": "MITRE Caldera agent detected",
    "Description": "Analysis of processes running within a container or directly on a Kubernetes node  has detected a suspicious process. This is often associated with the MITRE 54ndc47 agent which could be used maliciously to attack other machines.",
    "MITRE tactics": "Persistence  PrivilegeEscalation  DefenseEvasion  CredentialAccess  Discovery  LateralMovement  Execution  Collection  Exfiltration  Command And Control  Probing  Exploitation",
    "Severity": "Medium",
    "Alert Family": "Alerts for containers - Kubernetes clusters",
    "Alert Type ()": "(K8S.NODE_MitreCalderaTools)"
  },
  {
    "Alert": "An attempt to run Linux commands on a Windows App Service",
    "Description": "Analysis of App Service processes detected an attempt to run a Linux command on a Windows App Service. This action was running by the web application. This behavior is often seen during campaigns that exploit a vulnerability in a common web application.",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure App Service",
    "Alert Type ()": "(AppServices_LinuxCommandOnWindows)"
  },
  {
    "Alert": "An IP that connected to your Azure App Service FTP Interface was found in Threat Intelligence",
    "Description": "Azure App Service FTP log indicates a connection from a source address that was found in the threat intelligence feed. During this connection  a user accessed the pages listed.",
    "MITRE tactics": "Initial Access",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure App Service",
    "Alert Type ()": "(AppServices_IncomingTiClientIpFtp)"
  },
  {
    "Alert": "Attempt to run high privilege command detected",
    "Description": "Analysis of App Service processes detected an attempt to run a command that requires high privileges.",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure App Service",
    "Alert Type ()": "(AppServices_HighPrivilegeCommand)"
  },
  {
    "Alert": "Communication with suspicious domain identified by threat intelligence",
    "Description": "Communication with suspicious domain was detected by analyzing DNS transactions from your resource and comparing against known malicious domains identified by threat intelligence feeds. Communication to malicious domains is frequently performed by attackers and could imply that your resource is compromised.",
    "MITRE tactics": "Initial Access  Persistence  Execution  Command And Control  Exploitation",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure App Service",
    "Alert Type ()": "(AzureDNS_ThreatIntelSuspectDomain)"
  },
  {
    "Alert": "Connection to web page from anomalous IP address detected",
    "Description": "Azure App Service activity log indicates an anomalous connection to a sensitive web page from the listed source IP address. This might indicate that someone is attempting a brute force attack into your web app administration pages. It might also be the result of a new IP address being used by a legitimate user. If the source IP address is trusted  you can safely suppress this alert for this resource. To learn how to suppress security alerts  seeÿSuppress alerts from Microsoft Defender for Cloud.",
    "MITRE tactics": "Initial Access",
    "Severity": "Low",
    "Alert Family": "Alerts for Azure App Service",
    "Alert Type ()": "(AppServices_AnomalousPageAccess)"
  },
  {
    "Alert": "Dangling DNS record for an App Service resource detected",
    "Description": "A DNS record that points to a recently deleted App Service resource (also known as ?dangling DNS? entry) has been detected. This leaves you susceptible to a subdomain takeover. Subdomain takeovers enable malicious actors to redirect traffic intended for an organization?s domain to a site performing malicious activity.",
    "MITRE tactics": "-",
    "Severity": "High",
    "Alert Family": "Alerts for Azure App Service",
    "Alert Type ()": "(AppServices_DanglingDomain)"
  },
  {
    "Alert": "Detected encoded executable in command line data",
    "Description": "Analysis of host data on {Compromised host} detected a base-64 encoded executable. This has previously been associated with attackers attempting to construct executables on-the-fly through a sequence of commands  and attempting to evade intrusion detection systems by ensuring that no individual command would trigger an alert. This could be legitimate activity  or an indication of a compromised host.",
    "MITRE tactics": "Defense Evasion  Execution",
    "Severity": "High",
    "Alert Family": "Alerts for Azure App Service",
    "Alert Type ()": "(AppServices_Base64EncodedExecutableInCommandLineParams)"
  },
  {
    "Alert": "Detected file download from a known malicious source",
    "Description": "Analysis of host data has detected the download of a file from a known malware source on your host.",
    "MITRE tactics": "Privilege Escalation  Execution  Exfiltration  Command and Control",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure App Service",
    "Alert Type ()": "(AppServices_SuspectDownload)"
  },
  {
    "Alert": "Detected suspicious file download",
    "Description": "Analysis of host data has detected suspicious download of remote file.",
    "MITRE tactics": "Persistence",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure App Service",
    "Alert Type ()": "(AppServices_SuspectDownloadArtifacts)"
  },
  {
    "Alert": "Digital currency mining related behavior detected",
    "Description": "Analysis of host data on Inn-Flow-WebJobs detected the execution of a process or command normally associated with digital currency mining.",
    "MITRE tactics": "Execution",
    "Severity": "High",
    "Alert Family": "Alerts for Azure App Service",
    "Alert Type ()": "(AppServices_DigitalCurrencyMining)"
  },
  {
    "Alert": "Executable decoded using certutil",
    "Description": "Analysis of host data on [Compromised entity] detected that certutil.exe  a built-in administrator utility  was being used to decode an executable instead of its mainstream purpose that relates to manipulating certificates and certificate data. Attackers are known to abuse functionality of legitimate administrator tools to perform malicious actions  for example using a tool such as certutil.exe to decode a malicious executable that will then be subsequently executed.",
    "MITRE tactics": "Defense Evasion  Execution",
    "Severity": "High",
    "Alert Family": "Alerts for Azure App Service",
    "Alert Type ()": "(AppServices_ExecutableDecodedUsingCertutil)"
  },
  {
    "Alert": "Fileless Attack Behavior Detected",
    "Description": "The memory of the process specified below contains behaviors commonly used by fileless attacks.",
    "MITRE tactics": "Execution",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure App Service",
    "Alert Type ()": "(AppServices_FilelessAttackBehaviorDetection)"
  },
  {
    "Alert": "Fileless Attack Technique Detected",
    "Description": "The memory of the process specified below contains evidence of a fileless attack technique. Fileless attacks are used by attackers to execute code while evading detection by security software.",
    "MITRE tactics": "Execution",
    "Severity": "High",
    "Alert Family": "Alerts for Azure App Service",
    "Alert Type ()": "(AppServices_FilelessAttackTechniqueDetection)"
  },
  {
    "Alert": "Fileless Attack Toolkit Detected",
    "Description": "The memory of the process specified below contains a fileless attack toolkit: {ToolKitName}. Fileless attack toolkits typically do not have a presence on the filesystem  making detection by traditional anti-virus software difficult.",
    "MITRE tactics": "Defense Evasion  Execution",
    "Severity": "High",
    "Alert Family": "Alerts for Azure App Service",
    "Alert Type ()": "(AppServices_FilelessAttackToolkitDetection)"
  },
  {
    "Alert": "Microsoft Defender for Cloud test alert for App Service (not a threat)",
    "Description": "This is a test alert generated by Microsoft Defender for Cloud. No further action is needed.",
    "MITRE tactics": "-",
    "Severity": "High",
    "Alert Family": "Alerts for Azure App Service",
    "Alert Type ()": "(AppServices_EICAR)"
  },
  {
    "Alert": "NMap scanning detected",
    "Description": "Azure App Service activity log indicates a possible web fingerprinting activity on your App Service resource.",
    "MITRE tactics": "PreAttack",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure App Service",
    "Alert Type ()": "(AppServices_Nmap)"
  },
  {
    "Alert": "Phishing content hosted on Azure Webapps",
    "Description": "URL used for phishing attack found on the Azure AppServices website. This URL was part of a phishing attack sent to Microsoft 365 customers. The content typically lures visitors into entering their corporate credentials or financial information into a legitimate looking website.",
    "MITRE tactics": "Collection",
    "Severity": "High",
    "Alert Family": "Alerts for Azure App Service",
    "Alert Type ()": "(AppServices_PhishingContent)"
  },
  {
    "Alert": "PHP file in upload folder",
    "Description": "Azure App Service activity log indicates an access to a suspicious PHP page located in the upload folder.",
    "MITRE tactics": "Execution",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure App Service",
    "Alert Type ()": "(AppServices_PhpInUploadFolder)"
  },
  {
    "Alert": "Possible Cryptocoinminer download detected",
    "Description": "Analysis of host data has detected the download of a file normally associated with digital currency mining.",
    "MITRE tactics": "Defense Evasion  Command and Control  Exploitation",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure App Service",
    "Alert Type ()": "(AppServices_CryptoCoinMinerDownload)"
  },
  {
    "Alert": "Possible data exfiltration detected",
    "Description": "Analysis of host/device data detected a possible data egress condition. Attackers will often egress data from machines they have compromised.",
    "MITRE tactics": "Collection  Exfiltration",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure App Service",
    "Alert Type ()": "(AppServices_DataEgressArtifacts)"
  },
  {
    "Alert": "Potential dangling DNS record for an App Service resource detected",
    "Description": "A DNS record that points to a recently deleted App Service resource (also known as ?dangling DNS? entry) has been detected. This might leave you susceptible to a subdomain takeover. Subdomain takeovers enable malicious actors to redirect traffic intended for an organization?s domain to a site performing malicious activity. In this case  a text record with the Domain Verification ID was found. Such text records prevent subdomain takeover but we still recommend removing the dangling domain. If you leave the DNS record pointing at the subdomain you?re at risk if anyone in your organization deletes the TXT file or record in the future.",
    "MITRE tactics": "-",
    "Severity": "Low",
    "Alert Family": "Alerts for Azure App Service",
    "Alert Type ()": "(AppServices_PotentialDanglingDomain)"
  },
  {
    "Alert": "Potential reverse shell detected",
    "Description": "Analysis of host data detected a potential reverse shell. These are used to get a compromised machine to call back into a machine an attacker owns.",
    "MITRE tactics": "Exfiltration  Exploitation",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure App Service",
    "Alert Type ()": "(AppServices_ReverseShell)"
  },
  {
    "Alert": "Raw data download detected",
    "Description": "Analysis of App Service processes detected an attempt to download code from raw-data websites such as Pastebin. This action was run by a PHP process. This behavior is associated with attempts to download web shells or other malicious components to the App Service.",
    "MITRE tactics": "Execution",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure App Service",
    "Alert Type ()": "(AppServices_DownloadCodeFromWebsite)"
  },
  {
    "Alert": "Saving curl output to disk detected",
    "Description": "Analysis of App Service processes detected the running of a curl command in which the output was saved to the disk. While this behavior can be legitimate  in web applications this behavior is also observed in malicious activities such as attempts to infect websites with web shells.",
    "MITRE tactics": "-",
    "Severity": "Low",
    "Alert Family": "Alerts for Azure App Service",
    "Alert Type ()": "(AppServices_CurlToDisk)"
  },
  {
    "Alert": "Spam folder referrer detected",
    "Description": "Azure App Service activity log indicates web activity that was identified as originating from a web site associated with spam activity. This can occur if your website is compromised and used for spam activity.",
    "MITRE tactics": "-",
    "Severity": "Low",
    "Alert Family": "Alerts for Azure App Service",
    "Alert Type ()": "(AppServices_SpamReferrer)"
  },
  {
    "Alert": "Suspicious access to possibly vulnerable web page detected",
    "Description": "Azure App Service activity log indicates a web page that seems to be sensitive was accessed. This suspicious activity originated from a source IP address whose access pattern resembles that of a web scanner.",
    "MITRE tactics": "-",
    "Severity": "Low",
    "Alert Family": "Alerts for Azure App Service",
    "Alert Type ()": "(AppServices_ScanSensitivePage)"
  },
  {
    "Alert": "Suspicious domain name reference",
    "Description": "Analysis of host data detected reference to suspicious domain name. Such activity  while possibly legitimate user behavior  is frequently an indication of the download or execution of malicious software. Typical related attacker activity is likely to include the download and execution of further malicious software or remote administration tools.",
    "MITRE tactics": "Exfiltration",
    "Severity": "Low",
    "Alert Family": "Alerts for Azure App Service",
    "Alert Type ()": "(AppServices_CommandlineSuspectDomain)"
  },
  {
    "Alert": "Suspicious download using Certutil detected",
    "Description": "Analysis of host data on {NAME} detected the use of certutil.exe  a built-in administrator utility  for the download of a binary instead of its mainstream purpose that relates to manipulating certificates and certificate data. Attackers are known to abuse functionality of legitimate administrator tools to perform malicious actions  for example using certutil.exe to download and decode a malicious executable that will then be subsequently executed.",
    "MITRE tactics": "Execution",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure App Service",
    "Alert Type ()": "(AppServices_DownloadUsingCertutil)"
  },
  {
    "Alert": "Suspicious PHP execution detected",
    "Description": "Machine logs indicate that a suspicious PHP process is running. The action included an attempt to run operating system commands or PHP code from the command line  by using the PHP process. While this behavior can be legitimate  in web applications this behavior might indicate malicious activities  such as attempts to infect websites with web shells.",
    "MITRE tactics": "Execution",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure App Service",
    "Alert Type ()": "(AppServices_SuspectPhp)"
  },
  {
    "Alert": "Suspicious PowerShell cmdlets executed",
    "Description": "Analysis of host data indicates execution of known malicious PowerShell PowerSploit cmdlets.",
    "MITRE tactics": "Execution",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure App Service",
    "Alert Type ()": "(AppServices_PowerShellPowerSploitScriptExecution)"
  },
  {
    "Alert": "Suspicious process executed",
    "Description": "Machine logs indicate that the suspicious process: ?%{process path}? was running on the machine  often associated with attacker attempts to access credentials.",
    "MITRE tactics": "Credential Access",
    "Severity": "High",
    "Alert Family": "Alerts for Azure App Service",
    "Alert Type ()": "(AppServices_KnownCredential AccessTools)"
  },
  {
    "Alert": "Suspicious process name detected",
    "Description": "Analysis of host data on {NAME} detected a process whose name is suspicious  for example corresponding to a known attacker tool or named in a way that is suggestive of attacker tools that try to hide in plain sight. This process could be legitimate activity  or an indication that one of your machines has been compromised.",
    "MITRE tactics": "Persistence  Defense Evasion",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure App Service",
    "Alert Type ()": "(AppServices_ProcessWithKnownSuspiciousExtension)"
  },
  {
    "Alert": "Suspicious SVCHOST process executed",
    "Description": "The system process SVCHOST was observed running in an abnormal context. Malware often use SVCHOST to mask its malicious activity.",
    "MITRE tactics": "Defense Evasion  Execution",
    "Severity": "High",
    "Alert Family": "Alerts for Azure App Service",
    "Alert Type ()": "(AppServices_SVCHostFromInvalidPath)"
  },
  {
    "Alert": "Suspicious User Agent detected",
    "Description": "Azure App Service activity log indicates requests with suspicious user agent. This behavior can indicate on attempts to exploit a vulnerability in your App Service application.",
    "MITRE tactics": "Initial Access",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure App Service",
    "Alert Type ()": "(AppServices_UserAgentInjection)"
  },
  {
    "Alert": "Suspicious WordPress theme invocation detected",
    "Description": "Azure App Service activity log indicates a possible code injection activity on your App Service resource.",
    "MITRE tactics": "Execution",
    "Severity": "High",
    "Alert Family": "Alerts for Azure App Service",
    "Alert Type ()": "(AppServices_WpThemeInjection)"
  },
  {
    "Alert": "Vulnerability scanner detected",
    "Description": "Azure App Service activity log indicates that a possible vulnerability scanner was used on your App Service resource.",
    "MITRE tactics": "PreAttack",
    "Severity": "Low",
    "Alert Family": "Alerts for Azure App Service",
    "Alert Type ()": "(AppServices_DrupalScanner)"
  },
  {
    "Alert": "Vulnerability scanner detected",
    "Description": "Azure App Service activity log indicates that a possible vulnerability scanner was used on your App Service resource.",
    "MITRE tactics": "PreAttack",
    "Severity": "Low",
    "Alert Family": "Alerts for Azure App Service",
    "Alert Type ()": "(AppServices_JoomlaScanner)"
  },
  {
    "Alert": "Vulnerability scanner detected",
    "Description": "Azure App Service activity log indicates that a possible vulnerability scanner was used on your App Service resource.",
    "MITRE tactics": "PreAttack",
    "Severity": "Low",
    "Alert Family": "Alerts for Azure App Service",
    "Alert Type ()": "(AppServices_WpScanner)"
  },
  {
    "Alert": "Web fingerprinting detected",
    "Description": "Azure App Service activity log indicates a possible web fingerprinting activity on your App Service resource.",
    "MITRE tactics": "PreAttack",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure App Service",
    "Alert Type ()": "(AppServices_WebFingerprinting)"
  },
  {
    "Alert": "Website is tagged as malicious in threat intelligence feed",
    "Description": "Your website as described below is marked as a malicious site by Windows SmartScreen. If you think this is a false positive  contact Windows SmartScreen via report feedback link provided.",
    "MITRE tactics": "Collection",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure App Service",
    "Alert Type ()": "(AppServices_SmartScreen)"
  },
  {
    "Alert": "a history file has been cleared",
    "Description": "Analysis of host data indicates that the command history log file has been cleared. Attackers may do this to cover their traces. The operation was performed by user: ?%{user name}?.",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Antimalware broad files exclusion in your virtual machine",
    "Description": "Files exclusion from antimalware extension with broad exclusion rule was detected in your virtual machine by analyzing the Azure Resource Manager operations in your subscription. Such exclusion practically disabling the Antimalware protection.",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": "(VM_AmBroadFilesExclusion)"
  },
  {
    "Alert": "Antimalware disabled and code execution in your virtual machine",
    "Description": "Antimalware disabled at the same time as code execution on your virtual machine. This was detected by analyzing Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "-",
    "Severity": "High",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": "(VM_AmDisablementAndCodeExecution)"
  },
  {
    "Alert": "Antimalware disabled in your virtual machine",
    "Description": "Antimalware disabled in your virtual machine. This was detected by analyzing Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "Defense Evasion",
    "Severity": "Medium",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": "(VM_AmDisablement)"
  },
  {
    "Alert": "Antimalware file exclusion and code execution in your virtual machine",
    "Description": "File excluded from your antimalware scanner at the same time as code was executed via a custom script extension on your virtual machine. This was detected by analyzing Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "Defense Evasion  Execution",
    "Severity": "High",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": "(VM_AmFileExclusionAndCodeExecution)"
  },
  {
    "Alert": "Antimalware file exclusion and code execution in your virtual machine",
    "Description": "Temporary file exclusion from antimalware extension in parallel to execution of code via custom script extension was detected in your virtual machine by analyzing the Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "Defense Evasion  Execution",
    "Severity": "High",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": "(VM_AmTempFileExclusionAndCodeExecution)"
  },
  {
    "Alert": "Antimalware file exclusion in your virtual machine",
    "Description": "File excluded from your antimalware scanner on your virtual machine. This was detected by analyzing Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "Defense Evasion",
    "Severity": "Medium",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": "(VM_AmTempFileExclusion)"
  },
  {
    "Alert": "Antimalware real-time protection was disabled in your virtual machine",
    "Description": "Real-time protection disablement of the antimalware extension was detected in your virtual machine by analyzing the Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "Defense Evasion",
    "Severity": "Medium",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": "(VM_AmRealtimeProtectionDisabled)"
  },
  {
    "Alert": "Antimalware real-time protection was disabled temporarily in your virtual machine",
    "Description": "Real-time protection temporary disablement of the antimalware extension was detected in your virtual machine by analyzing the Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "Defense Evasion",
    "Severity": "Medium",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": "(VM_AmTempRealtimeProtectionDisablement)"
  },
  {
    "Alert": "Antimalware real-time protection was disabled temporarily while code was executed in your virtual machine",
    "Description": "Real-time protection temporary disablement of the antimalware extension in parallel to code execution via custom script extension was detected in your virtual machine by analyzing the Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "-",
    "Severity": "High",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": "(VM_AmRealtimeProtectionDisablementAndCodeExec)"
  },
  {
    "Alert": "Antimalware scans blocked for files potentially related to malware campaigns on your virtual machine (Preview)",
    "Description": "An exclusion rule was detected in your virtual machine to prevent your antimalware extension scanning certain files that are suspected of being related to a malware campaign. The rule was detected by analyzing the Azure Resource Manager operations in your subscription. Attackers might exclude files from antimalware scans to prevent detection while running arbitrary code or infecting the machine with malware.",
    "MITRE tactics": "Defense Evasion",
    "Severity": "Medium",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": "(VM_AmMalwareCampaignRelatedExclusion)"
  },
  {
    "Alert": "Antimalware temporarily disabled in your virtual machine",
    "Description": "Antimalware temporarily disabled in your virtual machine. This was detected by analyzing Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": "(VM_AmTemporarilyDisablement)"
  },
  {
    "Alert": "Antimalware unusual file exclusion in your virtual machine",
    "Description": "Unusual file exclusion from antimalware extension was detected in your virtual machine by analyzing the Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "Defense Evasion",
    "Severity": "Medium",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": "(VM_UnusualAmFileExclusion)"
  },
  {
    "Alert": "Behavior similar to ransomware detected [seen multiple times]",
    "Description": "Analysis of host data on %{Compromised Host} detected the execution of files that have resemblance of known ransomware that can prevent users from accessing their system or personal files  and demands ransom payment in order to regain access. This behavior was seen [x] times today on the following machines: [Machine names]",
    "MITRE tactics": "-",
    "Severity": "High",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Communication with suspicious domain identified by threat intelligence",
    "Description": "Communication with suspicious domain was detected by analyzing DNS transactions from your resource and comparing against known malicious domains identified by threat intelligence feeds. Communication to malicious domains is frequently performed by attackers and could imply that your resource is compromised.",
    "MITRE tactics": "Initial Access  Persistence  Execution  Command And Control  Exploitation",
    "Severity": "Medium",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": "(AzureDNS_ThreatIntelSuspectDomain)"
  },
  {
    "Alert": "Container with a miner image detected",
    "Description": "Machine logs indicate execution of a Docker container that runs an image associated with a digital currency mining.",
    "MITRE tactics": "Execution",
    "Severity": "High",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": "(VM_MinerInContainerImage)"
  },
  {
    "Alert": "Custom script extension with suspicious command in your virtual machine",
    "Description": "Custom script extension with suspicious command was detected in your virtual machine by analyzing the Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "Execution",
    "Severity": "Medium",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": "(VM_CustomScriptExtensionSuspiciousCmd)"
  },
  {
    "Alert": "Custom script extension with suspicious entry-point in your virtual machine",
    "Description": "Custom script extension with a suspicious entry-point was detected in your virtual machine by analyzing the Azure Resource Manager operations in your subscription. The entry-point refers to a suspicious GitHub repository.",
    "MITRE tactics": "Execution",
    "Severity": "Medium",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": "(VM_CustomScriptExtensionSuspiciousEntryPoint)"
  },
  {
    "Alert": "Custom script extension with suspicious payload in your virtual machine",
    "Description": "Custom script extension with a payload from a suspicious GitHub repository was detected in your virtual machine by analyzing the Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "Execution",
    "Severity": "Medium",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": "(VM_CustomScriptExtensionSuspiciousPayload)"
  },
  {
    "Alert": "Detected anomalous mix of upper and lower case characters in command line",
    "Description": "Analysis of host data on %{Compromised Host} detected a command line with anomalous mix of upper and lower case characters. This kind of pattern  while possibly benign  is also typical of attackers trying to hide from case-sensitive or hash-based rule matching when performing administrative tasks on a compromised host.",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Detected file download from a known malicious source",
    "Description": "Analysis of host data has detected the download of a file from a known malware source on %{Compromised Host}.",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Detected suspicious network activity",
    "Description": "Analysis of network traffic from %{Compromised Host} detected suspicious network activity. Such traffic  while possibly benign  is typically used by an attacker to communicate with malicious servers for downloading of tools  command-and-control and exfiltration of data. Typical related attacker activity includes copying remote administration tools to a compromised host and exfiltrating user data from it.",
    "MITRE tactics": "-",
    "Severity": "Low",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Digital currency mining related behavior detected",
    "Description": "Analysis of host data on %{Compromised Host} detected the execution of a process or command normally associated with digital currency mining.",
    "MITRE tactics": "-",
    "Severity": "High",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Disabling of auditd logging [seen multiple times]",
    "Description": "The Linux Audit system provides a way to track security-relevant information on the system. It records as much information about the events that are happening on your system as possible. Disabling auditd logging could hamper discovering violations of security policies used on the system. This behavior was seen [x] times today on the following machines: [Machine names]",
    "MITRE tactics": "-",
    "Severity": "Low",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Exploitation of Xorg vulnerability [seen multiple times]",
    "Description": "Analysis of host data on %{Compromised Host} detected the user of Xorg with suspicious arguments. Attackers may use this technique in privilege escalation attempts. This behavior was seen [x] times today on the following machines: [Machine names]",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Failed SSH brute force attack",
    "Description": "Failed brute force attacks were detected from the following attackers: %{Attackers}. Attackers were trying to access the host with the following user names: %{Accounts used on failed sign in to host attempts}.",
    "MITRE tactics": "Probing",
    "Severity": "Medium",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": "(VM_SshBruteForceFailed)"
  },
  {
    "Alert": "Fileless Attack Behavior Detected",
    "Description": "The memory of the process specified below contains behaviors commonly used by fileless attacks.",
    "MITRE tactics": "Execution",
    "Severity": "Low",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": "(VM_FilelessAttackBehavior.Linux)"
  },
  {
    "Alert": "Fileless Attack Technique Detected",
    "Description": "The memory of the process specified below contains evidence of a fileless attack technique. Fileless attacks are used by attackers to execute code while evading detection by security software.",
    "MITRE tactics": "Execution",
    "Severity": "High",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": "(VM_FilelessAttackTechnique.Linux)"
  },
  {
    "Alert": "Fileless Attack Toolkit Detected",
    "Description": "The memory of the process specified below contains a fileless attack toolkit: {ToolKitName}. Fileless attack toolkits typically don?t have a presence on the filesystem  making detection by traditional anti-virus software difficult.",
    "MITRE tactics": "Defense Evasion  Execution",
    "Severity": "High",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": "(VM_FilelessAttackToolkit.Linux)"
  },
  {
    "Alert": "Hidden file execution detected",
    "Description": "Analysis of host data indicates that a hidden file was executed by %{user name}. This activity could either be legitimate activity  or an indication of a compromised host.",
    "MITRE tactics": "-",
    "Severity": "Informational",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "New SSH key added [seen multiple times]",
    "Description": "A new SSH key was added to the authorized keys file. This behavior was seen [x] times today on the following machines: [Machine names]",
    "MITRE tactics": "Persistence",
    "Severity": "Low",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": "(VM_SshKeyAddition)"
  },
  {
    "Alert": "New SSH key added",
    "Description": "A new SSH key was added to the authorized keys file",
    "MITRE tactics": "-",
    "Severity": "Low",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Possible backdoor detected [seen multiple times]",
    "Description": "Analysis of host data has detected a suspicious file being downloaded then run on %{Compromised Host} in your subscription. This activity has previously been associated with installation of a backdoor. This behavior was seen [x] times today on the following machines: [Machine names]",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Possible exploitation of the mailserver detected",
    "Description": "Analysis of host data on %{Compromised Host} detected an unusual execution under the mail server account",
    "MITRE tactics": "Exploitation",
    "Severity": "Medium",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": "(VM_MailserverExploitation )"
  },
  {
    "Alert": "Possible malicious web shell detected",
    "Description": "Analysis of host data on %{Compromised Host} detected a possible web shell. Attackers will often upload a web shell to a machine they?ve compromised to gain persistence or for further exploitation.",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Possible password change using crypt-method detected [seen multiple times]",
    "Description": "Analysis of host data on %{Compromised Host} detected password change using crypt method. Attackers can make this change to continue access and gaining persistence after compromise. This behavior was seen [x] times today on the following machines: [Machine names]",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Process associated with digital currency mining detected [seen multiple times]",
    "Description": "Analysis of host data on %{Compromised Host} detected the execution of a process normally associated with digital currency mining. This behavior was seen over 100 times today on the following machines: [Machine name]",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Process associated with digital currency mining detected",
    "Description": "Host data analysis detected the execution of a process that is normally associated with digital currency mining.",
    "MITRE tactics": "Exploitation  Execution",
    "Severity": "Medium",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Python encoded downloader detected [seen multiple times]",
    "Description": "Analysis of host data on %{Compromised Host} detected the execution of encoded Python that downloads and runs code from a remote location. This may be an indication of malicious activity. This behavior was seen [x] times today on the following machines: [Machine names]",
    "MITRE tactics": "-",
    "Severity": "Low",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Screenshot taken on host [seen multiple times]",
    "Description": "Analysis of host data on %{Compromised Host} detected the user of a screen capture tool. Attackers may use these tools to access private data. This behavior was seen [x] times today on the following machines: [Machine names]",
    "MITRE tactics": "-",
    "Severity": "Low",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Shellcode detected [seen multiple times]",
    "Description": "Analysis of host data on %{Compromised Host} detected shellcode being generated from the command line. This process could be legitimate activity  or an indication that one of your machines has been compromised. This behavior was seen [x] times today on the following machines: [Machine names]",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Successful SSH brute force attack",
    "Description": "Analysis of host data has detected a successful brute force attack. The IP %{Attacker source IP} was seen making multiple login attempts. Successful logins were made from that IP with the following user(s): %{Accounts used to successfully sign in to host}. This means that the host may be compromised and controlled by a malicious actor.",
    "MITRE tactics": "Exploitation",
    "Severity": "High",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": "(VM_SshBruteForceSuccess)"
  },
  {
    "Alert": "Suspicious Account Creation Detected",
    "Description": "Analysis of host data on %{Compromised Host} detected creation or use of a local account %{Suspicious account name} : this account name closely resembles a standard Windows account or group name ?%{Similar To Account Name}?. This is potentially a rogue account created by an attacker  so named in order to avoid being noticed by a human administrator.",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Suspicious failed execution of custom script extension in your virtual machine",
    "Description": "Suspicious failure of a custom script extension was detected in your virtual machine by analyzing the Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "Execution",
    "Severity": "Medium",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": "(VM_CustomScriptExtensionSuspiciousFailure)"
  },
  {
    "Alert": "Suspicious kernel module detected [seen multiple times]",
    "Description": "Analysis of host data on %{Compromised Host} detected a shared object file being loaded as a kernel module. This could be legitimate activity  or an indication that one of your machines has been compromised. This behavior was seen [x] times today on the following machines: [Machine names]",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Suspicious password access [seen multiple times]",
    "Description": "Analysis of host data has detected suspicious access to encrypted user passwords on %{Compromised Host}. This behavior was seen [x] times today on the following machines: [Machine names]",
    "MITRE tactics": "-",
    "Severity": "Informational",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Suspicious password access",
    "Description": "Analysis of host data has detected suspicious access to encrypted user passwords on %{Compromised Host}.",
    "MITRE tactics": "-",
    "Severity": "Informational",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Suspicious request to the Kubernetes Dashboard",
    "Description": "Machine logs indicate that a suspicious request was made to the Kubernetes Dashboard. The request was sent from a Kubernetes node  possibly from one of the containers running in the node. Although this behavior can be intentional  it might indicate that the node is running a compromised container.",
    "MITRE tactics": "LateralMovement",
    "Severity": "Medium",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": "(VM_KubernetesDashboard)"
  },
  {
    "Alert": "Unusual config reset in your virtual machine",
    "Description": "An unusual config reset was detected in your virtual machine by analyzing the Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "Credential Access",
    "Severity": "Medium",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": "(VM_VMAccessUnusualConfigReset)"
  },
  {
    "Alert": "Unusual deletion of custom script extension in your virtual machine",
    "Description": "Unusual deletion of a custom script extension was detected in your virtual machine by analyzing the Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "Execution",
    "Severity": "Medium",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": "(VM_CustomScriptExtensionUnusualDeletion)"
  },
  {
    "Alert": "Unusual execution of custom script extension in your virtual machine",
    "Description": "Unusual execution of a custom script extension was detected in your virtual machine by analyzing the Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "Execution",
    "Severity": "Medium",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": "(VM_CustomScriptExtensionUnusualExecution)"
  },
  {
    "Alert": "Unusual user password reset in your virtual machine",
    "Description": "An unusual user password reset was detected in your virtual machine by analyzing the Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "Credential Access",
    "Severity": "Medium",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": "(VM_VMAccessUnusualPasswordReset)"
  },
  {
    "Alert": "Unusual user SSH key reset in your virtual machine",
    "Description": "An unusual user SSH key reset was detected in your virtual machine by analyzing the Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "Credential Access",
    "Severity": "Medium",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": "(VM_VMAccessUnusualSSHReset)"
  },
  {
    "Alert": "Suspicious installation of GPU extension in your virtual machine (Preview)",
    "Description": "Suspicious installation of a GPU extension was detected in your virtual machine by analyzing the Azure Resource Manager operations in your subscription. Attackers may use the GPU driver extension to install GPU drivers on your virtual machine via the Azure Resource Manager to perform cryptojacking.",
    "MITRE tactics": "Impact",
    "Severity": "Low",
    "Alert Family": "Alerts for Linux machines",
    "Alert Type ()": "(VM_GPUDriverExtensionUnusualExecution)"
  },
  {
    "Alert": "A logon from a malicious IP has been detected. [seen multiple times]",
    "Description": "A successful remote authentication for the account [account] and process [process] occurred  however the logon IP address (x.x.x.x) has previously been reported as malicious or highly unusual. A successful attack has probably occurred. Files with the .scr extensions are screen saver files and are normally reside and execute from the Windows system directory.",
    "MITRE tactics": "-",
    "Severity": "High",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Addition of Guest account to Local Administrators group",
    "Description": "Analysis of host data has detected the addition of the built-in Guest account to the Local Administrators group on %{Compromised Host}  which is strongly associated with attacker activity.",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "An event log was cleared",
    "Description": "Machine logs indicate a suspicious event log clearing operation by user: ?%{user name}? in Machine: ?%{CompromisedEntity}?. The %{log channel} log was cleared.",
    "MITRE tactics": "-",
    "Severity": "Informational",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Antimalware Action Failed",
    "Description": "Microsoft Antimalware has encountered an error when taking an action on malware or other potentially unwanted software.",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Antimalware Action Taken",
    "Description": "Microsoft Antimalware for Azure has taken an action to protect this machine from malware or other potentially unwanted software.",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Antimalware broad files exclusion in your virtual machine",
    "Description": "Files exclusion from antimalware extension with broad exclusion rule was detected in your virtual machine by analyzing the Azure Resource Manager operations in your subscription. Such exclusion practically disabling the Antimalware protection.",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": "(VM_AmBroadFilesExclusion)"
  },
  {
    "Alert": "Antimalware disabled and code execution in your virtual machine",
    "Description": "Antimalware disabled at the same time as code execution on your virtual machine. This was detected by analyzing Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "-",
    "Severity": "High",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": "(VM_AmDisablementAndCodeExecution)"
  },
  {
    "Alert": "Antimalware disabled in your virtual machine",
    "Description": "Antimalware disabled in your virtual machine. This was detected by analyzing Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "Defense Evasion",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": "(VM_AmDisablement)"
  },
  {
    "Alert": "Antimalware file exclusion and code execution in your virtual machine",
    "Description": "File excluded from your antimalware scanner at the same time as code was executed via a custom script extension on your virtual machine. This was detected by analyzing Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "Defense Evasion  Execution",
    "Severity": "High",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": "(VM_AmFileExclusionAndCodeExecution)"
  },
  {
    "Alert": "Antimalware file exclusion and code execution in your virtual machine",
    "Description": "Temporary file exclusion from antimalware extension in parallel to execution of code via custom script extension was detected in your virtual machine by analyzing the Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "Defense Evasion  Execution",
    "Severity": "High",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": "(VM_AmTempFileExclusionAndCodeExecution)"
  },
  {
    "Alert": "Antimalware file exclusion in your virtual machine",
    "Description": "File excluded from your antimalware scanner on your virtual machine. This was detected by analyzing Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "Defense Evasion",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": "(VM_AmTempFileExclusion)"
  },
  {
    "Alert": "Antimalware real-time protection was disabled in your virtual machine",
    "Description": "Real-time protection disablement of the antimalware extension was detected in your virtual machine by analyzing the Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "Defense Evasion",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": "(VM_AmRealtimeProtectionDisabled)"
  },
  {
    "Alert": "Antimalware real-time protection was disabled temporarily in your virtual machine",
    "Description": "Real-time protection temporary disablement of the antimalware extension was detected in your virtual machine by analyzing the Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "Defense Evasion",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": "(VM_AmTempRealtimeProtectionDisablement)"
  },
  {
    "Alert": "Antimalware real-time protection was disabled temporarily while code was executed in your virtual machine",
    "Description": "Real-time protection temporary disablement of the antimalware extension in parallel to code execution via custom script extension was detected in your virtual machine by analyzing the Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "-",
    "Severity": "High",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": "(VM_AmRealtimeProtectionDisablementAndCodeExec)"
  },
  {
    "Alert": "Antimalware scans blocked for files potentially related to malware campaigns on your virtual machine (Preview)",
    "Description": "An exclusion rule was detected in your virtual machine to prevent your antimalware extension scanning certain files that are suspected of being related to a malware campaign. The rule was detected by analyzing the Azure Resource Manager operations in your subscription. Attackers might exclude files from antimalware scans to prevent detection while running arbitrary code or infecting the machine with malware.",
    "MITRE tactics": "Defense Evasion",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": "(VM_AmMalwareCampaignRelatedExclusion)"
  },
  {
    "Alert": "Antimalware temporarily disabled in your virtual machine",
    "Description": "Antimalware temporarily disabled in your virtual machine. This was detected by analyzing Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": "(VM_AmTemporarilyDisablement)"
  },
  {
    "Alert": "Antimalware unusual file exclusion in your virtual machine",
    "Description": "Unusual file exclusion from antimalware extension was detected in your virtual machine by analyzing the Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "Defense Evasion",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": "(VM_UnusualAmFileExclusion)"
  },
  {
    "Alert": "Communication with suspicious domain identified by threat intelligence",
    "Description": "Communication with suspicious domain was detected by analyzing DNS transactions from your resource and comparing against known malicious domains identified by threat intelligence feeds. Communication to malicious domains is frequently performed by attackers and could imply that your resource is compromised.",
    "MITRE tactics": "Initial Access  Persistence  Execution  Command And Control  Exploitation",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": "(AzureDNS_ThreatIntelSuspectDomain)"
  },
  {
    "Alert": "Custom script extension with suspicious command in your virtual machine",
    "Description": "Custom script extension with suspicious command was detected in your virtual machine by analyzing the Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "Execution",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": "(VM_CustomScriptExtensionSuspiciousCmd)"
  },
  {
    "Alert": "Custom script extension with suspicious entry-point in your virtual machine",
    "Description": "Custom script extension with a suspicious entry-point was detected in your virtual machine by analyzing the Azure Resource Manager operations in your subscription. The entry-point refers to a suspicious GitHub repository.",
    "MITRE tactics": "Execution",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": "(VM_CustomScriptExtensionSuspiciousEntryPoint)"
  },
  {
    "Alert": "Custom script extension with suspicious payload in your virtual machine",
    "Description": "Custom script extension with a payload from a suspicious GitHub repository was detected in your virtual machine by analyzing the Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "Execution",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": "(VM_CustomScriptExtensionSuspiciousPayload)"
  },
  {
    "Alert": "Detected actions indicative of disabling and deleting IIS log files",
    "Description": "Analysis of host data detected actions that show IIS log files being disabled and/or deleted.",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Detected anomalous mix of upper and lower case characters in command-line",
    "Description": "Analysis of host data on %{Compromised Host} detected a command line with anomalous mix of upper and lower case characters. This kind of pattern  while possibly benign  is also typical of attackers trying to hide from case-sensitive or hash-based rule matching when performing administrative tasks on a compromised host.",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Detected change to a registry key that can be abused to bypass UAC",
    "Description": "Analysis of host data on %{Compromised Host} detected that a registry key that can be abused to bypass UAC (User Account Control) was changed. This kind of configuration  while possibly benign  is also typical of attacker activity when trying to move from unprivileged (standard user) to privileged (for example administrator) access on a compromised host.",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Detected decoding of an executable using built-in certutil.exe tool",
    "Description": "Analysis of host data on %{Compromised Host} detected that certutil.exe  a built-in administrator utility  was being used to decode an executable instead of its mainstream purpose that relates to manipulating certificates and certificate data. Attackers are known to abuse functionality of legitimate administrator tools to perform malicious actions  for example using a tool such as certutil.exe to decode a malicious executable that will then be subsequently executed.",
    "MITRE tactics": "-",
    "Severity": "High",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Detected enabling of the WDigest UseLogonCredential registry key",
    "Description": "Analysis of host data detected a change in the registry key HKLM\\SYSTEM\\ CurrentControlSet\\Control\\SecurityProviders\\WDigest\\ ?UseLogonCredential?. Specifically this key has been updated to allow logon credentials to be stored in clear text in LSA memory. Once enabled  an attacker can dump clear text passwords from LSA memory with credential harvesting tools such as Mimikatz.",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Detected encoded executable in command line data",
    "Description": "Analysis of host data on %{Compromised Host} detected a base-64 encoded executable. This has previously been associated with attackers attempting to construct executables on-the-fly through a sequence of commands  and attempting to evade intrusion detection systems by ensuring that no individual command would trigger an alert. This could be legitimate activity  or an indication of a compromised host.",
    "MITRE tactics": "-",
    "Severity": "High",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Detected obfuscated command line",
    "Description": "Attackers use increasingly complex obfuscation techniques to evade detections that run against the underlying data. Analysis of host data on %{Compromised Host} detected suspicious indicators of obfuscation on the commandline.",
    "MITRE tactics": "-",
    "Severity": "Informational",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Detected Petya ransomware indicators",
    "Description": "Analysis of host data on %{Compromised Host} detected indicators associated with Petya ransomware. Seeÿhttps://aka.ms/petya-blogÿfor more information. Review the command line associated in this alert and escalate this alert to your security team.",
    "MITRE tactics": "-",
    "Severity": "High",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Detected possible execution of keygen executable",
    "Description": "Analysis of host data on %{Compromised Host} detected execution of a process whose name is indicative of a keygen tool; such tools are typically used to defeat software licensing mechanisms but their download is often bundled with other malicious software. Activity group GOLD has been known to make use of such keygens to covertly gain back door access to hosts that they compromise.",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Detected possible execution of malware dropper",
    "Description": "Analysis of host data on %{Compromised Host} detected a filename that has previously been associated with one of activity group GOLD?s methods of installing malware on a victim host.",
    "MITRE tactics": "-",
    "Severity": "High",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Detected possible local reconnaissance activity",
    "Description": "Analysis of host data on %{Compromised Host} detected a combination of systeminfo commands that has previously been associated with one of activity group GOLD?s methods of performing reconnaissance activity. While ?systeminfo.exe? is a legitimate Windows tool  executing it twice in succession in the way that has occurred here is rare.",
    "MITRE tactics": "-",
    "Severity": "",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Detected potentially suspicious use of Telegram tool",
    "Description": "Analysis of host data shows installation of Telegram  a free cloud-based instant messaging service that exists both for mobile and desktop system. Attackers are known to abuse this service to transfer malicious binaries to any other computer  phone  or tablet.",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Detected suppression of legal notice displayed to users at logon",
    "Description": "Analysis of host data on %{Compromised Host} detected changes to the registry key that controls whether a legal notice is displayed to users when they log on. Microsoft security analysis has determined that this is a common activity undertaken by attackers after having compromised a host.",
    "MITRE tactics": "-",
    "Severity": "Low",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Detected suspicious combination of HTA and PowerShell",
    "Description": "mshta.exe (Microsoft HTML Application Host) which is a signed Microsoft binary is being used by the attackers to launch malicious PowerShell commands. Attackers often resort to having an HTA file with inline VBScript. When a victim browses to the HTA file and chooses to run it  the PowerShell commands and scripts that it contains are executed. Analysis of host data on %{Compromised Host} detected mshta.exe launching PowerShell commands.",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Detected suspicious commandline arguments",
    "Description": "Analysis of host data on %{Compromised Host} detected suspicious commandline arguments that have been used in conjunction with a reverse shell used by activity group HYDROGEN.",
    "MITRE tactics": "-",
    "Severity": "High",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Detected suspicious commandline used to start all executables in a directory",
    "Description": "Analysis of host data has detected a suspicious process running on %{Compromised Host}. The commandline indicates an attempt to start all executables (*.exe) that may reside in a directory. This could be an indication of a compromised host.",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Detected suspicious credentials in commandline",
    "Description": "Analysis of host data on %{Compromised Host} detected a suspicious password being used to execute a file by activity group BORON. This activity group has been known to use this password to execute Pirpi malware on a victim host.",
    "MITRE tactics": "-",
    "Severity": "High",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Detected suspicious document credentials",
    "Description": "Analysis of host data on %{Compromised Host} detected a suspicious  common precomputed password hash used by malware being used to execute a file. Activity group HYDROGEN has been known to use this password to execute malware on a victim host.",
    "MITRE tactics": "-",
    "Severity": "High",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Detected suspicious execution of VBScript.Encode command",
    "Description": "Analysis of host data on %{Compromised Host} detected the execution of VBScript.Encode command. This encodes the scripts into unreadable text  making it more difficult for users to examine the code. Microsoft threat research shows that attackers often use encoded VBscript files as part of their attack to evade detection systems. This could be legitimate activity  or an indication of a compromised host.",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Detected suspicious execution via rundll32.exe",
    "Description": "Analysis of host data on %{Compromised Host} detected rundll32.exe being used to execute a process with an uncommon name  consistent with the process naming scheme previously seen used by activity group GOLD when installing their first stage implant on a compromised host.",
    "MITRE tactics": "-",
    "Severity": "High",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Detected suspicious file cleanup commands",
    "Description": "Analysis of host data on %{Compromised Host} detected a combination of systeminfo commands that has previously been associated with one of activity group GOLD?s methods of performing post-compromise self-cleanup activity. While ?systeminfo.exe? is a legitimate Windows tool  executing it twice in succession  followed by a delete command in the way that has occurred here is rare.",
    "MITRE tactics": "-",
    "Severity": "High",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Detected suspicious file creation",
    "Description": "Analysis of host data on %{Compromised Host} detected creation or execution of a process that has previously indicated post-compromise action taken on a victim host by activity group BARIUM. This activity group has been known to use this technique to download more malware to a compromised host after an attachment in a phishing doc has been opened.",
    "MITRE tactics": "-",
    "Severity": "High",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Detected suspicious named pipe communications",
    "Description": "Analysis of host data on %{Compromised Host} detected data being written to a local named pipe from a Windows console command. Named pipes are known to be a channel used by attackers to task and communicate with a malicious implant. This could be legitimate activity  or an indication of a compromised host.",
    "MITRE tactics": "-",
    "Severity": "High",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Detected suspicious network activity",
    "Description": "Analysis of network traffic from %{Compromised Host} detected suspicious network activity. Such traffic  while possibly benign  is typically used by an attacker to communicate with malicious servers for downloading of tools  command-and-control and exfiltration of data. Typical related attacker activity includes copying remote administration tools to a compromised host and exfiltrating user data from it.",
    "MITRE tactics": "-",
    "Severity": "Low",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Detected suspicious new firewall rule",
    "Description": "Analysis of host data detected a new firewall rule has been added via netsh.exe to allow traffic from an executable in a suspicious location.",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Detected suspicious use of Cacls to lower the security state of the system",
    "Description": "Attackers use myriad ways like brute force  spear phishing etc. to achieve initial compromise and get a foothold on the network. Once initial compromise is achieved they often take steps to lower the security settings of a system. Cacls?short for change access control list is Microsoft Windows native command-line utility often used for modifying the security permission on folders and files. A lot of time the binary is used by the attackers to lower the security settings of a system. This is done by giving Everyone full access to some of the system binaries like ftp.exe  net.exe  wscript.exe etc. Analysis of host data on %{Compromised Host} detected suspicious use of Cacls to lower the security of a system.",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Detected suspicious use of FTP -s Switch",
    "Description": "Analysis of process creation data from the %{Compromised Host} detected the use of the FTP ?-s:filename? switch. This switch is used to specify an FTP script file for the client to run. Malware or malicious processes are known to use this FTP switch (-s:filename) to point to a script file  which is configured to connect to a remote FTP server and download more malicious binaries.",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Detected suspicious use of Pcalua.exe to launch executable code",
    "Description": "Analysis of host data on %{Compromised Host} detected the use of pcalua.exe to launch executable code. Pcalua.exe is component of the Microsoft Windows ?Program Compatibility Assistant?  which detects compatibility issues during the installation or execution of a program. Attackers are known to abuse functionality of legitimate Windows system tools to perform malicious actions  for example using pcalua.exe with the -a switch to launch malicious executables either locally or from remote shares.",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Detected the disabling of critical services",
    "Description": "The analysis of host data on %{Compromised Host} detected execution of ?net.exe stop? command being used to stop critical services like SharedAccess or the Windows Security app. The stopping of either of these services can be indication of a malicious behavior.",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Digital currency mining related behavior detected",
    "Description": "Analysis of host data on %{Compromised Host} detected the execution of a process or command normally associated with digital currency mining.",
    "MITRE tactics": "-",
    "Severity": "High",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Dynamic PS script construction",
    "Description": "Analysis of host data on %{Compromised Host} detected a PowerShell script being constructed dynamically. Attackers sometimes use this approach of progressively building up a script in order to evade IDS systems. This could be legitimate activity  or an indication that one of your machines has been compromised.",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Executable found running from a suspicious location",
    "Description": "Analysis of host data detected an executable file on %{Compromised Host} that is running from a location in common with known suspicious files. This executable could either be legitimate activity  or an indication of a compromised host.",
    "MITRE tactics": "-",
    "Severity": "High",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Fileless attack behavior detected",
    "Description": "The memory of the process specified contains behaviors commonly used by fileless attacks. Specific behaviors include:",
    "MITRE tactics": "Defense Evasion",
    "Severity": "Low",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": "(VM_FilelessAttackBehavior.Windows)"
  },
  {
    "Alert": "Fileless attack technique detected",
    "Description": "The memory of the process specified below contains evidence of a fileless attack technique. Fileless attacks are used by attackers to execute code while evading detection by security software. Specific behaviors include:",
    "MITRE tactics": "Defense Evasion  Execution",
    "Severity": "High",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": "(VM_FilelessAttackTechnique.Windows)"
  },
  {
    "Alert": "Fileless attack toolkit detected",
    "Description": "The memory of the process specified contains a fileless attack toolkit: [toolkit name]. Fileless attack toolkits use techniques that minimize or eliminate traces of malware on disk  and greatly reduce the chances of detection by disk-based malware scanning solutions. Specific behaviors include:",
    "MITRE tactics": "Defense Evasion  Execution",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": "(VM_FilelessAttackToolkit.Windows)"
  },
  {
    "Alert": "High risk software detected",
    "Description": "Analysis of host data from %{Compromised Host} detected the usage of software that has been associated with the installation of malware in the past. A common technique utilized in the distribution of malicious software is to package it within otherwise benign tools such as the one seen in this alert. When you use these tools  the malware can be silently installed in the background.",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Local Administrators group members were enumerated",
    "Description": "Machine logs indicate a successful enumeration on group %{Enumerated Group Domain Name}%{Enumerated Group Name}. Specifically  %{Enumerating User Domain Name}%{Enumerating User Name} remotely enumerated the members of the %{Enumerated Group Domain Name}%{Enumerated Group Name} group. This activity could either be legitimate activity  or an indication that a machine in your organization has been compromised and used to reconnaissance %{vmname}.",
    "MITRE tactics": "-",
    "Severity": "Informational",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Malicious firewall rule created by ZINC server implant [seen multiple times]",
    "Description": "A firewall rule was created using techniques that match a known actor  ZINC. The rule was possibly used to open a port on %{Compromised Host} to allow for Command & Control communications. This behavior was seen [x] times today on the following machines: [Machine names]",
    "MITRE tactics": "-",
    "Severity": "High",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Malicious SQL activity",
    "Description": "Machine logs indicate that ?%{process name}? was executed by account: %{user name}. This activity is considered malicious.",
    "MITRE tactics": "-",
    "Severity": "High",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Multiple Domain Accounts Queried",
    "Description": "Analysis of host data has determined that an unusual number of distinct domain accounts are being queried within a short time period from %{Compromised Host}. This kind of activity could be legitimate  but can also be an indication of compromise.",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Possible credential dumping detected [seen multiple times]",
    "Description": "Analysis of host data has detected use of native windows tool (for example  sqldumper.exe) being used in a way that allows to extract credentials from memory. Attackers often use these techniques to extract credentials that they then further use for lateral movement and privilege escalation. This behavior was seen [x] times today on the following machines: [Machine names]",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Potential attempt to bypass AppLocker detected",
    "Description": "Analysis of host data on %{Compromised Host} detected a potential attempt to bypass AppLocker restrictions. AppLocker can be configured to implement a policy that limits what executables are allowed to run on a Windows system. The command-line pattern similar to that identified in this alert has been previously associated with attacker attempts to circumvent AppLocker policy by using trusted executables (allowed by AppLocker policy) to execute untrusted code. This could be legitimate activity  or an indication of a compromised host.",
    "MITRE tactics": "-",
    "Severity": "High",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "PsExec execution detected",
    "Description": "Analysis of host data indicates that the process %{Process Name} was executed by PsExec utility. PsExec can be used for running processes remotely. This technique might be used for malicious purposes.",
    "MITRE tactics": "Lateral Movement  Execution",
    "Severity": "Informational",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": "(VM_RunByPsExec)"
  },
  {
    "Alert": "Ransomware indicators detected [seen multiple times]",
    "Description": "Analysis of host data indicates suspicious activity traditionally associated with lock-screen and encryption ransomware. Lock screen ransomware displays a full-screen message preventing interactive use of the host and access to its files. Encryption ransomware prevents access by encrypting data files. In both cases a ransom message is typically displayed  requesting payment in order to restore file access. This behavior was seen [x] times today on the following machines: [Machine names]",
    "MITRE tactics": "-",
    "Severity": "High",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Ransomware indicators detected",
    "Description": "Analysis of host data indicates suspicious activity traditionally associated with lock-screen and encryption ransomware. Lock screen ransomware displays a full-screen message preventing interactive use of the host and access to its files. Encryption ransomware prevents access by encrypting data files. In both cases a ransom message is typically displayed  requesting payment in order to restore file access.",
    "MITRE tactics": "-",
    "Severity": "High",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Rare SVCHOST service group executed",
    "Description": "The system process SVCHOST was observed running a rare service group. Malware often uses SVCHOST to masquerade its malicious activity.",
    "MITRE tactics": "Defense Evasion  Execution",
    "Severity": "Informational",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": "(VM_SvcHostRunInRareServiceGroup)"
  },
  {
    "Alert": "Sticky keys attack detected",
    "Description": "Analysis of host data indicates that an attacker may be subverting an accessibility binary (for example sticky keys  onscreen keyboard  narrator) in order to provide backdoor access to the host %{Compromised Host}.",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Successful brute force attack",
    "Description": "Several sign in attempts were detected from the same source. Some successfully authenticated to the host.",
    "MITRE tactics": "Exploitation",
    "Severity": "Medium/High",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": "(VM_LoginBruteForceSuccess)"
  },
  {
    "Alert": "Suspect integrity level indicative of RDP hijacking",
    "Description": "Analysis of host data has detected the tscon.exe running with SYSTEM privileges - this can be indicative of an attacker abusing this binary in order to switch context to any other logged on user on this host; it?s a known attacker technique to compromise more user accounts and move laterally across a network.",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Suspect service installation",
    "Description": "Analysis of host data has detected the installation of tscon.exe as a service: this binary being started as a service potentially allows an attacker to trivially switch to any other logged on user on this host by hijacking RDP connections; it?s a known attacker technique to compromise more user accounts and move laterally across a network.",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Suspected Kerberos Golden Ticket attack parameters observed",
    "Description": "Analysis of host data detected commandline parameters consistent with a Kerberos Golden Ticket attack.",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Suspicious Account Creation Detected",
    "Description": "Analysis of host data on %{Compromised Host} detected creation or use of a local account %{Suspicious account name} : this account name closely resembles a standard Windows account or group name ?%{Similar To Account Name}?. This is potentially a rogue account created by an attacker  so named in order to avoid being noticed by a human administrator.",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Suspicious Activity Detected",
    "Description": "Analysis of host data has detected a sequence of one or more processes running on %{machine name} that have historically been associated with malicious activity. While individual commands may appear benign the alert is scored based on an aggregation of these commands. This could either be legitimate activity  or an indication of a compromised host.",
    "MITRE tactics": "Execution",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": "(VM_SuspiciousActivity)"
  },
  {
    "Alert": "Suspicious authentication activity",
    "Description": "Although none of them succeeded  some of them used accounts were recognized by the host. This resembles a dictionary attack  in which an attacker performs numerous authentication attempts using a dictionary of predefined account names and passwords in order to find valid credentials to access the host. This indicates that some of your host account names might exist in a well-known account name dictionary.",
    "MITRE tactics": "Probing",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": "(VM_LoginBruteForceValidUserFailed)"
  },
  {
    "Alert": "Suspicious code segment detected",
    "Description": "Indicates that a code segment has been allocated by using non-standard methods  such as reflective injection and process hollowing. The alert provides more characteristics of the code segment that have been processed to provide context for the capabilities and behaviors of the reported code segment.",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Suspicious double extension file executed",
    "Description": "Analysis of host data indicates an execution of a process with a suspicious double extension. This extension may trick users into thinking files are safe to be opened and might indicate the presence of malware on the system.",
    "MITRE tactics": "-",
    "Severity": "High",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Suspicious download using Certutil detected [seen multiple times]",
    "Description": "Analysis of host data on %{Compromised Host} detected the use of certutil.exe  a built-in administrator utility  for the download of a binary instead of its mainstream purpose that relates to manipulating certificates and certificate data. Attackers are known to abuse functionality of legitimate administrator tools to perform malicious actions  for example using certutil.exe to download and decode a malicious executable that will then be subsequently executed. This behavior was seen [x] times today on the following machines: [Machine names]",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Suspicious download using Certutil detected",
    "Description": "Analysis of host data on %{Compromised Host} detected the use of certutil.exe  a built-in administrator utility  for the download of a binary instead of its mainstream purpose that relates to manipulating certificates and certificate data. Attackers are known to abuse functionality of legitimate administrator tools to perform malicious actions  for example using certutil.exe to download and decode a malicious executable that will then be subsequently executed.",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Suspicious failed execution of custom script extension in your virtual machine",
    "Description": "Suspicious failure of a custom script extension was detected in your virtual machine by analyzing the Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "Execution",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": "(VM_CustomScriptExtensionSuspiciousFailure)"
  },
  {
    "Alert": "Suspicious PowerShell Activity Detected",
    "Description": "Analysis of host data detected a PowerShell script running on %{Compromised Host} that has features in common with known suspicious scripts. This script could either be legitimate activity  or an indication of a compromised host.",
    "MITRE tactics": "-",
    "Severity": "High",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Suspicious PowerShell cmdlets executed",
    "Description": "Analysis of host data indicates execution of known malicious PowerShell PowerSploit cmdlets.",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Suspicious process executed [seen multiple times]",
    "Description": "Machine logs indicate that the suspicious process: ?%{Suspicious Process}? was running on the machine  often associated with attacker attempts to access credentials. This behavior was seen [x] times today on the following machines: [Machine names]",
    "MITRE tactics": "-",
    "Severity": "High",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Suspicious process executed",
    "Description": "Machine logs indicate that the suspicious process: ?%{Suspicious Process}? was running on the machine  often associated with attacker attempts to access credentials.",
    "MITRE tactics": "-",
    "Severity": "High",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Suspicious process name detected [seen multiple times]",
    "Description": "Analysis of host data on %{Compromised Host} detected a process whose name is suspicious  for example corresponding to a known attacker tool or named in a way that is suggestive of attacker tools that try to hide in plain sight. This process could be legitimate activity  or an indication that one of your machines has been compromised. This behavior was seen [x] times today on the following machines: [Machine names]",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Suspicious process name detected",
    "Description": "Analysis of host data on %{Compromised Host} detected a process whose name is suspicious  for example corresponding to a known attacker tool or named in a way that is suggestive of attacker tools that try to hide in plain sight. This process could be legitimate activity  or an indication that one of your machines has been compromised.",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Suspicious process termination burst",
    "Description": "Analysis of host data indicates a suspicious process termination burst in %{Machine Name}. Specifically  %{NumberOfCommands} processes were killed between %{Begin} and %{Ending}.",
    "MITRE tactics": "Defense Evasion",
    "Severity": "Low",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": "(VM_TaskkillBurst)"
  },
  {
    "Alert": "Suspicious SQL activity",
    "Description": "Machine logs indicate that ?%{process name}? was executed by account: %{user name}. This activity is uncommon with this account.",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Suspicious SVCHOST process executed",
    "Description": "The system process SVCHOST was observed running in an abnormal context. Malware often uses SVCHOST to masquerade its malicious activity.",
    "MITRE tactics": "-",
    "Severity": "High",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Suspicious system process executed",
    "Description": "The system process %{process name} was observed running in an abnormal context. Malware often uses this process name to masquerade its malicious activity.",
    "MITRE tactics": "Defense Evasion  Execution",
    "Severity": "High",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": "(VM_SystemProcessInAbnormalContext)"
  },
  {
    "Alert": "Suspicious Volume Shadow Copy Activity",
    "Description": "Analysis of host data has detected a shadow copy deletion activity on the resource. Volume Shadow Copy (VSC) is an important artifact that stores data snapshots. Some malware and specifically Ransomware  targets VSC to sabotage backup strategies.",
    "MITRE tactics": "-",
    "Severity": "High",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Suspicious WindowPosition registry value detected",
    "Description": "Analysis of host data on %{Compromised Host} detected an attempted WindowPosition registry configuration change that could be indicative of hiding application windows in nonvisible sections of the desktop. This could be legitimate activity  or an indication of a compromised machine: this type of activity has been previously associated with known adware (or unwanted software) such as Win32/OneSystemCare and Win32/SystemHealer and malware such as Win32/Creprote. When the WindowPosition value is set to 201329664  (Hex: 0x0c00 0c00  corresponding to X-axis=0c00 and the Y-axis=0c00) this places the console app?s window in a non-visible section of the user?s screen in an area that is hidden from view below the visible start menu/taskbar. Known suspect Hex value includes  but not limited to c000c000",
    "MITRE tactics": "-",
    "Severity": "Low",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Suspiciously named process detected",
    "Description": "Analysis of host data on %{Compromised Host} detected a process whose name is very similar to but different from a very commonly run process (%{Similar To Process Name}). While this process could be benign attackers are known to sometimes hide in plain sight by naming their malicious tools to resemble legitimate process names.",
    "MITRE tactics": "-",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Unusual config reset in your virtual machine",
    "Description": "An unusual config reset was detected in your virtual machine by analyzing the Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "Credential Access",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": "(VM_VMAccessUnusualConfigReset)"
  },
  {
    "Alert": "Unusual deletion of custom script extension in your virtual machine",
    "Description": "Unusual deletion of a custom script extension was detected in your virtual machine by analyzing the Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "Execution",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": "(VM_CustomScriptExtensionUnusualDeletion)"
  },
  {
    "Alert": "Unusual execution of custom script extension in your virtual machine",
    "Description": "Unusual execution of a custom script extension was detected in your virtual machine by analyzing the Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "Execution",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": "(VM_CustomScriptExtensionUnusualExecution)"
  },
  {
    "Alert": "Unusual process execution detected",
    "Description": "Analysis of host data on %{Compromised Host} detected the execution of a process by %{User Name} that was unusual. Accounts such as %{User Name} tend to perform a limited set of operations  this execution was determined to be out of character and may be suspicious.",
    "MITRE tactics": "-",
    "Severity": "High",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Unusual user password reset in your virtual machine",
    "Description": "An unusual user password reset was detected in your virtual machine by analyzing the Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "Credential Access",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": "(VM_VMAccessUnusualPasswordReset)"
  },
  {
    "Alert": "Unusual user SSH key reset in your virtual machine",
    "Description": "An unusual user SSH key reset was detected in your virtual machine by analyzing the Azure Resource Manager operations in your subscription.",
    "MITRE tactics": "Credential Access",
    "Severity": "Medium",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": "(VM_VMAccessUnusualSSHReset)"
  },
  {
    "Alert": "VBScript HTTP object allocation detected",
    "Description": "Creation of a VBScript file using Command Prompt has been detected. The following script contains HTTP object allocation command. This action can be used to download malicious files.",
    "MITRE tactics": "",
    "Severity": "",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": ""
  },
  {
    "Alert": "Suspicious installation of GPU extension in your virtual machine (Preview)",
    "Description": "Suspicious installation of a GPU extension was detected in your virtual machine by analyzing the Azure Resource Manager operations in your subscription. Attackers may use the GPU driver extension to install GPU drivers on your virtual machine via the Azure Resource Manager to perform cryptojacking.",
    "MITRE tactics": "Impact",
    "Severity": "Low",
    "Alert Family": "Alerts for Windows machines",
    "Alert Type ()": "(VM_GPUDriverExtensionUnusualExecution)"
  },
  {
    "Alert": "Suspicious failure installing GPU extension in your subscription (Preview)",
    "Description": "Suspicious intent of installing a GPU extension on unsupported VMs. This extension should be installed on virtual machines equipped with a graphic processor, and in this case the virtual machines are not equipped with such. These failures can be seen when malicious adversaries execute multiple installations of such extension for crypto-mining purposes.",
    "MITRE tactics": "Impact",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure VM extensions",
    "Alert Type ()": "(VM_GPUExtensionSuspiciousFailure)"
  },
  {
    "Alert": "Suspicious installation of a GPU extension was detected on your virtual machine (Preview)",
    "Description": "Suspicious installation of a GPU extension was detected on your virtual machine by analyzing the Azure Resource Manager operations in your subscription. Attackers may use the GPU driver extension to install GPU drivers on your virtual machine via the Azure Resource Manager to perform cryptojacking. This activity is deemed suspicious as the principal's behavior departs from its usual patterns.",
    "MITRE tactics": "Impact",
    "Severity": "Low",
    "Alert Family": "Alerts for Azure VM extensions",
    "Alert Type ()": "(VM_GPUDriverExtensionUnusualExecution)"
  },
  {
    "Alert": "Run Command with a suspicious script was detected on your virtual machine (Preview)",
    "Description": "A Run Command with a suspicious script was detected on your virtual machine by analyzing the Azure Resource Manager operations in your subscription. Attackers may use Run Command to execute malicious code with high privileges on your virtual machine via the Azure Resource Manager. The script is deemed suspicious as certain parts were identified as being potentially malicious.",
    "MITRE tactics": "Execution",
    "Severity": "High",
    "Alert Family": "Alerts for Azure VM extensions",
    "Alert Type ()": "(VM_RunCommandSuspiciousScript)"
  },
  {
    "Alert": "Suspicious unauthorized Run Command usage was detected on your virtual machine (Preview)",
    "Description": "Suspicious unauthorized usage of Run Command has failed and was detected on your virtual machine by analyzing the Azure Resource Manager operations in your subscription. Attackers may attempt to use Run Command to execute malicious code with high privileges on your virtual machines via the Azure Resource Manager. This activity is deemed suspicious as it hasn't been commonly seen before.",
    "MITRE tactics": "Execution",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure VM extensions",
    "Alert Type ()": "(VM_RunCommandSuspiciousFailure)"
  },
  {
    "Alert": "Suspicious Run Command usage was detected on your virtual machine (Preview)",
    "Description": "Suspicious usage of Run Command was detected on your virtual machine by analyzing the Azure Resource Manager operations in your subscription. Attackers may use Run Command to execute malicious code with high privileges on your virtual machines via the Azure Resource Manager. This activity is deemed suspicious as it hasn't been commonly seen before.",
    "MITRE tactics": "Execution",
    "Severity": "Low",
    "Alert Family": "Alerts for Azure VM extensions",
    "Alert Type ()": "(VM_RunCommandSuspiciousUsage)"
  },
  {
    "Alert": "Suspicious usage of multiple monitoring or data collection extensions was detected on your virtual machines (Preview)",
    "Description": "Suspicious usage of multiple monitoring or data collection extensions was detected on your virtual machines by analyzing the Azure Resource Manager operations in your subscription. Attackers may abuse such extensions for data collection, network traffic monitoring, and more, in your subscription. This usage is deemed suspicious as it hasn't been commonly seen before.",
    "MITRE tactics": "Reconnaissance",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure VM extensions",
    "Alert Type ()": "(VM_SuspiciousMultiExtensionUsage)"
  },
  {
    "Alert": "Suspicious installation of disk encryption extensions was detected on your virtual machines (Preview)",
    "Description": "Suspicious installation of disk encryption extensions was detected on your virtual machines by analyzing the Azure Resource Manager operations in your subscription. Attackers may abuse the disk encryption extension to deploy full disk encryptions on your virtual machines via the Azure Resource Manager in an attempt to perform ransomware activity. This activity is deemed suspicious as it hasn't been commonly seen before and due to the high number of extension installations.",
    "MITRE tactics": "Impact",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure VM extensions",
    "Alert Type ()": "(VM_DiskEncryptionSuspiciousUsage)"
  },
  {
    "Alert": "Suspicious usage of VMAccess extension was detected on your virtual machines (Preview)",
    "Description": "Suspicious usage of VMAccess extension was detected on your virtual machines. Attackers may abuse the VMAccess extension to gain access and compromise your virtual machines with high privileges by resetting access or managing administrative users. This activity is deemed suspicious as the principal's behavior departs from its usual patterns, and due to the high number of the extension installations.",
    "MITRE tactics": "Persistence",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure VM extensions",
    "Alert Type ()": "(VM_VMAccessSuspiciousUsage)"
  },
  {
    "Alert": "Desired State Configuration (DSC) extension with a suspicious script was detected on your virtual machine (Preview)",
    "Description": "Desired State Configuration (DSC) extension with a suspicious script was detected on your virtual machine by analyzing the Azure Resource Manager operations in your subscription. Attackers may use the Desired State Configuration (DSC) extension to deploy malicious configurations, such as persistence mechanisms, malicious scripts, and more, with high privileges, on your virtual machines. The script is deemed suspicious as certain parts were identified as being potentially malicious.",
    "MITRE tactics": "Execution",
    "Severity": "High",
    "Alert Family": "Alerts for Azure VM extensions",
    "Alert Type ()": "(VM_DSCExtensionSuspiciousScript)"
  },
  {
    "Alert": "Suspicious usage of a Desired State Configuration (DSC) extension was detected on your virtual machines (Preview)",
    "Description": "Suspicious usage of a Desired State Configuration (DSC) extension was detected on your virtual machines by analyzing the Azure Resource Manager operations in your subscription. Attackers may use the Desired State Configuration (DSC) extension to deploy malicious configurations, such as persistence mechanisms, malicious scripts, and more, with high privileges, on your virtual machines. This activity is deemed suspicious as the principal's behavior departs from its usual patterns, and due to the high number of the extension installations.",
    "MITRE tactics": "Impact",
    "Severity": "Low",
    "Alert Family": "Alerts for Azure VM extensions",
    "Alert Type ()": "(VM_DSCExtensionSuspiciousUsage)"
  },
  {
    "Alert": "Custom script extension with a suspicious script was detected on your virtual machine (Preview)",
    "Description": "Custom script extension with a suspicious script was detected on your virtual machine by analyzing the Azure Resource Manager operations in your subscription. Attackers may use Custom script extension to execute malicious code with high privileges on your virtual machine via the Azure Resource Manager. The script is deemed suspicious as certain parts were identified as being potentially malicious.",
    "MITRE tactics": "Execution",
    "Severity": "High",
    "Alert Family": "Alerts for Azure VM extensions",
    "Alert Type ()": "(VM_CustomScriptExtensionSuspiciousCmd)"
  },
  {
    "Alert": "Suspicious failed execution of custom script extension in your virtual machine",
    "Description": "Suspicious failure of a custom script extension was detected in your virtual machine by analyzing the Azure Resource Manager operations in your subscription. Such failures may be associated with malicious scripts run by this extension.",
    "MITRE tactics": "Execution",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure VM extensions",
    "Alert Type ()": "(VM_CustomScriptExtensionSuspiciousFailure)"
  },
  {
    "Alert": "Unusual deletion of custom script extension in your virtual machine",
    "Description": "Unusual deletion of a custom script extension was detected in your virtual machine by analyzing the Azure Resource Manager operations in your subscription. Attackers may use custom script extensions to execute malicious code on your virtual machines via the Azure Resource Manager.",
    "MITRE tactics": "Execution",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure VM extensions",
    "Alert Type ()": "(VM_CustomScriptExtensionUnusualDeletion)"
  },
  {
    "Alert": "Unusual execution of custom script extension in your virtual machine",
    "Description": "Unusual execution of a custom script extension was detected in your virtual machine by analyzing the Azure Resource Manager operations in your subscription. Attackers may use custom script extensions to execute malicious code on your virtual machines via the Azure Resource Manager.",
    "MITRE tactics": "Execution",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure VM extensions",
    "Alert Type ()": "(VM_CustomScriptExtensionUnusualExecution)"
  },
  {
    "Alert": "Custom script extension with suspicious entry-point in your virtual machine",
    "Description": "Custom script extension with a suspicious entry-point was detected in your virtual machine by analyzing the Azure Resource Manager operations in your subscription. The entry-point refers to a suspicious GitHub repository. Attackers may use custom script extensions to execute malicious code on your virtual machines via the Azure Resource Manager.",
    "MITRE tactics": "Execution",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure VM extensions",
    "Alert Type ()": "(VM_CustomScriptExtensionSuspiciousEntryPoint)"
  },
  {
    "Alert": "Custom script extension with suspicious payload in your virtual machine",
    "Description": "Custom script extension with a payload from a suspicious GitHub repository was detected in your virtual machine by analyzing the Azure Resource Manager operations in your subscription. Attackers may use custom script extensions to execute malicious code on your virtual machines via the Azure Resource Manager.",
    "MITRE tactics": "Execution",
    "Severity": "Medium",
    "Alert Family": "Alerts for Azure VM extensions",
    "Alert Type ()": "(VM_CustomScriptExtensionSuspiciousPayload)"
  }
]